#pragma once

// SOT: Sea of Thieves (1.0) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x4)
#endif

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// ScriptStruct Engine.TickFunction
// 0x0048
struct FTickFunction
{
	unsigned char                                      UnknownData00[0x8];                                       // 0x0000(0x0008) MISSED OFFSET
	TEnumAsByte<ETickingGroup>                         TickGroup;                                                // 0x0008(0x0001) (CPF_Edit, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_IsPlainOldData)
	unsigned char                                      bTickEvenWhenPaused : 1;                                  // 0x000A(0x0001) (CPF_Edit, CPF_DisableEditOnInstance BITFIELD: 0101)
	unsigned char                                      bCanEverTick : 1;                                         // 0x000A(0x0001) ( BITFIELD: 0202)
	unsigned char                                      bStartWithTickEnabled : 1;                                // 0x000A(0x0001) (CPF_Edit, CPF_DisableEditOnInstance BITFIELD: 0404)
	unsigned char                                      bAllowTickOnDedicatedServer : 1;                          // 0x000A(0x0001) (CPF_Edit, CPF_DisableEditOnInstance BITFIELD: 0808)
	unsigned char                                      UnknownData01[0x31];                                      // 0x000B(0x0031) MISSED OFFSET
	float                                              TickInterval;                                             // 0x003C(0x0004) (CPF_Edit, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_IsPlainOldData)
	unsigned char                                      UnknownData02[0x8];                                       // 0x0040(0x0008) MISSED OFFSET
};

// ScriptStruct Engine.ActorTickFunction
// 0x0008 (0x0050 - 0x0048)
struct FActorTickFunction : public FTickFunction
{
	unsigned char                                      UnknownData00[0x8];                                       // 0x0048(0x0008) MISSED OFFSET
};

// ScriptStruct Engine.RepMovement
// 0x0034
struct FRepMovement
{
	struct FVector                                     LinearVelocity;                                           // 0x0000(0x000C) (CPF_ZeroConstructor, CPF_Transient, CPF_IsPlainOldData)
	struct FVector                                     AngularVelocity;                                          // 0x000C(0x000C) (CPF_ZeroConstructor, CPF_Transient, CPF_IsPlainOldData)
	struct FVector                                     Location;                                                 // 0x0018(0x000C) (CPF_ZeroConstructor, CPF_Transient, CPF_IsPlainOldData)
	struct FRotator                                    Rotation;                                                 // 0x0024(0x000C) (CPF_ZeroConstructor, CPF_Transient, CPF_IsPlainOldData)
	unsigned char                                      bSimulatedPhysicSleep : 1;                                // 0x0030(0x0001) (CPF_Transient BITFIELD: 0101)
	unsigned char                                      bRepPhysics : 1;                                          // 0x0030(0x0001) (CPF_Transient BITFIELD: 0202)
	TEnumAsByte<EVectorQuantization>                   LocationQuantizationLevel;                                // 0x0031(0x0001) (CPF_Edit, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_IsPlainOldData)
	TEnumAsByte<EVectorQuantization>                   VelocityQuantizationLevel;                                // 0x0032(0x0001) (CPF_Edit, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_IsPlainOldData)
	TEnumAsByte<ERotatorQuantization>                  RotationQuantizationLevel;                                // 0x0033(0x0001) (CPF_Edit, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_IsPlainOldData)
};

// ScriptStruct Engine.Vector_NetQuantize100
// 0x0000 (0x000C - 0x000C)
struct FVector_NetQuantize100 : public FVector
{

};

// ScriptStruct Engine.RepAttachment
// 0x0040
struct FRepAttachment
{
	class AActor*                                      AttachParent;                                             // 0x0000(0x0008) (CPF_ZeroConstructor, CPF_IsPlainOldData)
	struct FVector_NetQuantize100                      LocationOffset;                                           // 0x0008(0x000C)
	struct FVector_NetQuantize100                      RelativeScale3D;                                          // 0x0014(0x000C)
	struct FRotator                                    RotationOffset;                                           // 0x0020(0x000C) (CPF_ZeroConstructor, CPF_IsPlainOldData)
	struct FName                                       AttachSocket;                                             // 0x002C(0x0008) (CPF_ZeroConstructor, CPF_IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0034(0x0004) MISSED OFFSET
	class USceneComponent*                             AttachComponent;                                          // 0x0038(0x0008) (CPF_ExportObject, CPF_ZeroConstructor, CPF_InstancedReference, CPF_IsPlainOldData)
};

// ScriptStruct Engine.ActorPtr
// 0x0008
struct FActorPtr
{
	class AActor*                                      Actor;                                                    // 0x0000(0x0008) (CPF_ZeroConstructor, CPF_IsPlainOldData)
};

// ScriptStruct Engine.ActorComponentTickFunction
// 0x0008 (0x0050 - 0x0048)
struct FActorComponentTickFunction : public FTickFunction
{
	unsigned char                                      UnknownData00[0x8];                                       // 0x0048(0x0008) MISSED OFFSET
};

// ScriptStruct Engine.SimpleMemberReference
// 0x0020
struct FSimpleMemberReference
{
	class UObject*                                     MemberParent;                                             // 0x0000(0x0008) (CPF_ZeroConstructor, CPF_IsPlainOldData)
	struct FName                                       MemberName;                                               // 0x0008(0x0008) (CPF_ZeroConstructor, CPF_IsPlainOldData)
	struct FGuid                                       MemberGuid;                                               // 0x0010(0x0010) (CPF_ZeroConstructor, CPF_IsPlainOldData)
};

// ScriptStruct Engine.AnimTickRecord
// 0x0040
struct FAnimTickRecord
{
	class UAnimationAsset*                             SourceAsset;                                              // 0x0000(0x0008) (CPF_ZeroConstructor, CPF_IsPlainOldData)
	unsigned char                                      UnknownData00[0x38];                                      // 0x0008(0x0038) MISSED OFFSET
};

// ScriptStruct Engine.AnimGroupInstance
// 0x0018
struct FAnimGroupInstance
{
	unsigned char                                      UnknownData00[0x18];                                      // 0x0000(0x0018) MISSED OFFSET
};

// ScriptStruct Engine.ActiveVertexAnim
// 0x0010
struct FActiveVertexAnim
{
	class UVertexAnimBase*                             VertAnim;                                                 // 0x0000(0x0008) (CPF_ZeroConstructor, CPF_IsPlainOldData)
	float                                              Weight;                                                   // 0x0008(0x0004) (CPF_ZeroConstructor, CPF_IsPlainOldData)
	float                                              Time;                                                     // 0x000C(0x0004) (CPF_ZeroConstructor, CPF_IsPlainOldData)
};

// ScriptStruct Engine.AnimLinkableElement
// 0x0030
struct FAnimLinkableElement
{
	unsigned char                                      UnknownData00[0x8];                                       // 0x0000(0x0008) MISSED OFFSET
	class UAnimMontage*                                LinkedMontage;                                            // 0x0008(0x0008) (CPF_ZeroConstructor, CPF_IsPlainOldData)
	int                                                SlotIndex;                                                // 0x0010(0x0004) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData)
	int                                                SegmentIndex;                                             // 0x0014(0x0004) (CPF_ZeroConstructor, CPF_IsPlainOldData)
	TEnumAsByte<EAnimLinkMethod>                       LinkMethod;                                               // 0x0018(0x0001) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData)
	TEnumAsByte<EAnimLinkMethod>                       CachedLinkMethod;                                         // 0x0019(0x0001) (CPF_ZeroConstructor, CPF_IsPlainOldData)
	float                                              SegmentBeginTime;                                         // 0x001C(0x0004) (CPF_ZeroConstructor, CPF_IsPlainOldData)
	float                                              SegmentLength;                                            // 0x0020(0x0004) (CPF_ZeroConstructor, CPF_IsPlainOldData)
	float                                              LinkValue;                                                // 0x0024(0x0004) (CPF_ZeroConstructor, CPF_IsPlainOldData)
	class UAnimSequenceBase*                           LinkedSequence;                                           // 0x0028(0x0008) (CPF_Edit, CPF_ZeroConstructor, CPF_EditConst, CPF_IsPlainOldData)
};

// ScriptStruct Engine.AnimNotifyEvent
// 0x0078 (0x00A8 - 0x0030)
struct FAnimNotifyEvent : public FAnimLinkableElement
{
	float                                              DisplayTime;                                              // 0x0030(0x0004) (CPF_ZeroConstructor, CPF_Deprecated, CPF_IsPlainOldData)
	float                                              TriggerTimeOffset;                                        // 0x0034(0x0004) (CPF_ZeroConstructor, CPF_IsPlainOldData)
	float                                              EndTriggerTimeOffset;                                     // 0x0038(0x0004) (CPF_ZeroConstructor, CPF_IsPlainOldData)
	float                                              TriggerWeightThreshold;                                   // 0x003C(0x0004) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	struct FName                                       NotifyName;                                               // 0x0040(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_IsPlainOldData)
	class UAnimNotify*                                 Notify;                                                   // 0x0048(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_ExportObject, CPF_ZeroConstructor, CPF_InstancedReference, CPF_IsPlainOldData)
	class UAnimNotifyState*                            NotifyStateClass;                                         // 0x0050(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_ExportObject, CPF_ZeroConstructor, CPF_InstancedReference, CPF_IsPlainOldData)
	float                                              Duration;                                                 // 0x0058(0x0004) (CPF_ZeroConstructor, CPF_IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x005C(0x0004) MISSED OFFSET
	struct FAnimLinkableElement                        EndLink;                                                  // 0x0060(0x0030)
	unsigned char                                      bConvertedFromBranchingPoint;                             // 0x0090(0x0001) (CPF_ZeroConstructor, CPF_IsPlainOldData)
	TEnumAsByte<EMontageNotifyTickType>                MontageTickType;                                          // 0x0091(0x0001) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	float                                              NotifyTriggerChance;                                      // 0x0094(0x0004) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	TEnumAsByte<ENotifyFilterType>                     NotifyFilterType;                                         // 0x0098(0x0001) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	int                                                NotifyFilterLOD;                                          // 0x009C(0x0004) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	unsigned char                                      bTriggerOnDedicatedServer;                                // 0x00A0(0x0001) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	int                                                TrackIndex;                                               // 0x00A4(0x0004) (CPF_ZeroConstructor, CPF_IsPlainOldData)
};

// ScriptStruct Engine.RainPostProcessSettings
// 0x00C0
struct FRainPostProcessSettings
{
	unsigned char                                      bUnknown0000_0101 : 1;                                    // 0x0000(0x0001) (CPF_BlueprintVisibleMANUAL_ADD_BIT 0101)
	unsigned char                                      bUnknown0000_0202 : 1;                                    // 0x0000(0x0001) (MANUAL_ADD_BIT 0202)
	unsigned char                                      bUnknown0000_0404 : 1;                                    // 0x0000(0x0001) (MANUAL_ADD_BIT 0404)
	unsigned char                                      bUnknown0000_0808 : 1;                                    // 0x0000(0x0001) (MANUAL_ADD_BIT 0808)
	unsigned char                                      bUnknown0000_1010 : 1;                                    // 0x0000(0x0001) (MANUAL_ADD_BIT 1010)
	unsigned char                                      bUnknown0000_2020 : 1;                                    // 0x0000(0x0001) (MANUAL_ADD_BIT 2020)
	unsigned char                                      bUnknown0000_4040 : 1;                                    // 0x0000(0x0001) (MANUAL_ADD_BIT 4040)
	unsigned char                                      bUnknown0000_8080 : 1;                                    // 0x0000(0x0001) (MANUAL_ADD_BIT 8080)
	unsigned char                                      bOverride_RainParticleTexture : 1;                        // 0x0000(0x0001) (CPF_BlueprintVisible BITFIELD: 0101)
	unsigned char                                      bOverride_RainMeshTexture : 1;                            // 0x0000(0x0001) (CPF_BlueprintVisible BITFIELD: 0202)
	unsigned char                                      bOverride_RainIntensity : 1;                              // 0x0000(0x0001) (CPF_BlueprintVisible BITFIELD: 0404)
	unsigned char                                      bOverride_RainParticleAlpha : 1;                          // 0x0000(0x0001) (CPF_BlueprintVisible BITFIELD: 0808)
	unsigned char                                      bOverride_RainCloseParticleAlphaReductionMultiplier : 1;  // 0x0000(0x0001) (CPF_BlueprintVisible BITFIELD: 1010)
	unsigned char                                      bOverride_RainCloseParticleAlphaDistance : 1;             // 0x0000(0x0001) (CPF_BlueprintVisible BITFIELD: 2020)
	unsigned char                                      bOverride_RainParticleDensity : 1;                        // 0x0000(0x0001) (CPF_BlueprintVisible BITFIELD: 4040)
	unsigned char                                      bOverride_RainParticleSpeed : 1;                          // 0x0000(0x0001) (CPF_BlueprintVisible BITFIELD: 8080)
	unsigned char                                      bOverride_RainParticleWindVelocity : 1;                   // 0x0001(0x0001) (CPF_BlueprintVisible BITFIELD: 0101)
	unsigned char                                      bOverride_RainParticleWidth : 1;                          // 0x0001(0x0001) (CPF_BlueprintVisible BITFIELD: 0202)
	unsigned char                                      bOverride_RainParticleLength : 1;                         // 0x0001(0x0001) (CPF_BlueprintVisible BITFIELD: 0404)
	unsigned char                                      bOverride_RainMeshScale : 1;                              // 0x0001(0x0001) (CPF_BlueprintVisible BITFIELD: 0808)
	unsigned char                                      bOverride_RainMeshTextureScroll : 1;                      // 0x0001(0x0001) (CPF_BlueprintVisible BITFIELD: 1010)
	unsigned char                                      bOverride_RainMeshTextureTiling : 1;                      // 0x0001(0x0001) (CPF_BlueprintVisible BITFIELD: 2020)
	unsigned char                                      bOverride_RainMeshAlpha : 1;                              // 0x0001(0x0001) (CPF_BlueprintVisible BITFIELD: 4040)
	unsigned char                                      bOverride_RainMeshRowDivision : 1;                        // 0x0001(0x0001) (CPF_BlueprintVisible BITFIELD: 8080)
	unsigned char                                      bOverride_RainMeshColumnDivision : 1;                     // 0x0002(0x0001) (CPF_BlueprintVisible BITFIELD: 0101)
	unsigned char                                      bOverride_RainMeshBrightness : 1;                         // 0x0002(0x0001) (CPF_BlueprintVisible BITFIELD: 0202)
	unsigned char                                      bOverride_RainBrightness : 1;                             // 0x0002(0x0001) (CPF_BlueprintVisible BITFIELD: 0404)
	unsigned char                                      bOverride_RainTint : 1;                                   // 0x0002(0x0001) (CPF_BlueprintVisible BITFIELD: 0808)
	unsigned char                                      bOverride_RainMeshEndRadiusScale : 1;                     // 0x0002(0x0001) (CPF_BlueprintVisible BITFIELD: 1010)
	unsigned char                                      bOverride_RainMeshEndAlphaFade : 1;                       // 0x0002(0x0001) (CPF_BlueprintVisible BITFIELD: 2020)
	unsigned char                                      bOverride_RainMeshFadeDistance : 1;                       // 0x0002(0x0001) (CPF_BlueprintVisible BITFIELD: 4040)
	unsigned char                                      bOverride_RainAnimationFrameTime : 1;                     // 0x0002(0x0001) (CPF_BlueprintVisible BITFIELD: 8080)
	unsigned char                                      bOverride_RainSplashesPerSecond : 1;                      // 0x0003(0x0001) (CPF_BlueprintVisible BITFIELD: 0101)
	unsigned char                                      bOverride_RainSplashesPerSquareMetre : 1;                 // 0x0003(0x0001) (CPF_BlueprintVisible BITFIELD: 0202)
	unsigned char                                      bOverride_RainSplashesMaxPlacementAngle : 1;              // 0x0003(0x0001) (CPF_BlueprintVisible BITFIELD: 0404)
	unsigned char                                      bOverride_RainSplashData : 1;                             // 0x0003(0x0001) (CPF_BlueprintVisible BITFIELD: 0808)
	unsigned char                                      bOverride_RainSplashesMaxDistance1 : 1;                   // 0x0003(0x0001) (CPF_BlueprintVisible BITFIELD: 1010)
	unsigned char                                      bOverride_RainSplashData2 : 1;                            // 0x0003(0x0001) (CPF_BlueprintVisible BITFIELD: 2020)
	unsigned char                                      bOverride_RainSplashesMaxDistance2 : 1;                   // 0x0003(0x0001) (CPF_BlueprintVisible BITFIELD: 4040)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0004(0x0004) MISSED OFFSET
	class UTexture*                                    RainParticleTexture;                                      // 0x0008(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	class UTexture*                                    RainMeshTexture;                                          // 0x0010(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	float                                              RainIntensity;                                            // 0x0018(0x0004) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	float                                              RainParticleAlpha;                                        // 0x001C(0x0004) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	float                                              RainCloseParticleAlphaReductionMultiplier;                // 0x0020(0x0004) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	float                                              RainCloseParticleAlphaDistance;                           // 0x0024(0x0004) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	float                                              RainParticleDensity;                                      // 0x0028(0x0004) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	float                                              RainParticleSpeed;                                        // 0x002C(0x0004) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	struct FVector                                     RainParticleWindVelocity;                                 // 0x0030(0x000C) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	float                                              RainParticleWidth;                                        // 0x003C(0x0004) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	float                                              RainParticleLength;                                       // 0x0040(0x0004) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	struct FVector                                     RainMeshScale;                                            // 0x0044(0x000C) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	struct FVector2D                                   RainMeshTextureScroll;                                    // 0x0050(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	struct FVector2D                                   RainMeshTextureTiling;                                    // 0x0058(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	float                                              RainMeshAlpha;                                            // 0x0060(0x0004) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	int                                                RainMeshRowDivision;                                      // 0x0064(0x0004) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	int                                                RainMeshColumnDivision;                                   // 0x0068(0x0004) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	float                                              RainMeshEndRadiusScale;                                   // 0x006C(0x0004) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	float                                              RainMeshEndAlphaFade;                                     // 0x0070(0x0004) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	float                                              RainMeshFadeDistance;                                     // 0x0074(0x0004) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	float                                              RainMeshBrightness;                                       // 0x0078(0x0004) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	float                                              RainBrightness;                                           // 0x007C(0x0004) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	struct FLinearColor                                RainTint;                                                 // 0x0080(0x0010) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	float                                              RainAnimationFrameTime;                                   // 0x0090(0x0004) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	int                                                RainSplashesPerSecond;                                    // 0x0094(0x0004) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	float                                              RainSplashesPerSquareMetre;                               // 0x0098(0x0004) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	float                                              RainSplashesMaxPlacementAngle;                            // 0x009C(0x0004) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	class UParticleComputeShaderData*                  RainSplashData;                                           // 0x00A0(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	float                                              RainSplashesMaxDistance1;                                 // 0x00A8(0x0004) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x00AC(0x0004) MISSED OFFSET
	class UParticleComputeShaderData*                  RainSplashData2;                                          // 0x00B0(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	float                                              RainSplashesMaxDistance2;                                 // 0x00B8(0x0004) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	unsigned char                                      UnknownData02[0x4];                                       // 0x00BC(0x0004) MISSED OFFSET
};

// ScriptStruct Engine.LPVCascadeSettings
// 0x0070
struct FLPVCascadeSettings
{
	unsigned char                                      bUnknown0000_0101 : 1;                                    // 0x0000(0x0001) (CPF_BlueprintVisibleMANUAL_ADD_BIT 0101)
	unsigned char                                      bUnknown0000_0202 : 1;                                    // 0x0000(0x0001) (MANUAL_ADD_BIT 0202)
	unsigned char                                      bUnknown0000_0404 : 1;                                    // 0x0000(0x0001) (MANUAL_ADD_BIT 0404)
	unsigned char                                      bUnknown0000_0808 : 1;                                    // 0x0000(0x0001) (MANUAL_ADD_BIT 0808)
	unsigned char                                      bUnknown0000_1010 : 1;                                    // 0x0000(0x0001) (MANUAL_ADD_BIT 1010)
	unsigned char                                      bUnknown0000_2020 : 1;                                    // 0x0000(0x0001) (MANUAL_ADD_BIT 2020)
	unsigned char                                      bUnknown0000_4040 : 1;                                    // 0x0000(0x0001) (MANUAL_ADD_BIT 4040)
	unsigned char                                      bUnknown0000_8080 : 1;                                    // 0x0000(0x0001) (MANUAL_ADD_BIT 8080)
	unsigned char                                      bOverride_LPVIntensity : 1;                               // 0x0000(0x0001) (CPF_BlueprintVisible BITFIELD: 0101)
	unsigned char                                      bOverride_LPVDirectionalOcclusionIntensity : 1;           // 0x0000(0x0001) (CPF_BlueprintVisible BITFIELD: 0202)
	unsigned char                                      bOverride_LPVDirectionalOcclusionRadius : 1;              // 0x0000(0x0001) (CPF_BlueprintVisible BITFIELD: 0404)
	unsigned char                                      bOverride_LPVDiffuseOcclusionExponent : 1;                // 0x0000(0x0001) (CPF_BlueprintVisible BITFIELD: 0808)
	unsigned char                                      bOverride_LPVSpecularOcclusionExponent : 1;               // 0x0000(0x0001) (CPF_BlueprintVisible BITFIELD: 1010)
	unsigned char                                      bOverride_LPVDiffuseOcclusionIntensity : 1;               // 0x0000(0x0001) (CPF_BlueprintVisible BITFIELD: 2020)
	unsigned char                                      bOverride_LPVSpecularOcclusionIntensity : 1;              // 0x0000(0x0001) (CPF_BlueprintVisible BITFIELD: 4040)
	unsigned char                                      bOverride_LPVSize : 1;                                    // 0x0000(0x0001) (CPF_BlueprintVisible BITFIELD: 8080)
	unsigned char                                      bOverride_LPVSecondaryOcclusionIntensity : 1;             // 0x0001(0x0001) (CPF_BlueprintVisible BITFIELD: 0101)
	unsigned char                                      bOverride_LPVSecondaryBounceIntensity : 1;                // 0x0001(0x0001) (CPF_BlueprintVisible BITFIELD: 0202)
	unsigned char                                      bOverride_LPVGeometryVolumeBias : 1;                      // 0x0001(0x0001) (CPF_BlueprintVisible BITFIELD: 0404)
	unsigned char                                      bOverride_LPVVplInjectionBias : 1;                        // 0x0001(0x0001) (CPF_BlueprintVisible BITFIELD: 0808)
	unsigned char                                      bOverride_LPVEmissiveInjectionIntensity : 1;              // 0x0001(0x0001) (CPF_BlueprintVisible BITFIELD: 1010)
	unsigned char                                      bOverride_NumberOfPropagationSteps : 1;                   // 0x0001(0x0001) (CPF_BlueprintVisible BITFIELD: 2020)
	unsigned char                                      bFreezeLPVUpdate : 1;                                     // 0x0001(0x0001) (CPF_Edit, CPF_BlueprintVisible BITFIELD: 4040)
	float                                              LPVIntensity;                                             // 0x0004(0x0004) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	float                                              LPVVplInjectionBias;                                      // 0x0008(0x0004) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	float                                              LPVSize;                                                  // 0x000C(0x0004) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	float                                              LPVSecondaryOcclusionIntensity;                           // 0x0010(0x0004) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	float                                              LPVSecondaryBounceIntensity;                              // 0x0014(0x0004) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	float                                              LPVGeometryVolumeBias;                                    // 0x0018(0x0004) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	float                                              LPVEmissiveInjectionIntensity;                            // 0x001C(0x0004) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	float                                              LPVDirectionalOcclusionIntensity;                         // 0x0020(0x0004) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	float                                              LPVDirectionalOcclusionRadius;                            // 0x0024(0x0004) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	float                                              LPVDiffuseOcclusionExponent;                              // 0x0028(0x0004) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	float                                              LPVSpecularOcclusionExponent;                             // 0x002C(0x0004) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	float                                              LPVDiffuseOcclusionIntensity;                             // 0x0030(0x0004) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	float                                              LPVSpecularOcclusionIntensity;                            // 0x0034(0x0004) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	int                                                LPVNumberOfPropagationSteps;                              // 0x0038(0x0004) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x003C(0x0004) MISSED OFFSET
	struct FTransform                                  LPVWorldRef;                                              // 0x0040(0x0030) (CPF_Edit, CPF_BlueprintVisible, CPF_IsPlainOldData)
};

// ScriptStruct Engine.PlayerAmbientLightOverrideSettings
// 0x0018
struct FPlayerAmbientLightOverrideSettings
{
	unsigned char                                      bUnknown0000_0101 : 1;                                    // 0x0000(0x0001) (CPF_BlueprintVisibleMANUAL_ADD_BIT 0101)
	unsigned char                                      bUnknown0000_0202 : 1;                                    // 0x0000(0x0001) (MANUAL_ADD_BIT 0202)
	unsigned char                                      bUnknown0000_0404 : 1;                                    // 0x0000(0x0001) (MANUAL_ADD_BIT 0404)
	unsigned char                                      bUnknown0000_0808 : 1;                                    // 0x0000(0x0001) (MANUAL_ADD_BIT 0808)
	unsigned char                                      bUnknown0000_1010 : 1;                                    // 0x0000(0x0001) (MANUAL_ADD_BIT 1010)
	unsigned char                                      bUnknown0000_2020 : 1;                                    // 0x0000(0x0001) (MANUAL_ADD_BIT 2020)
	unsigned char                                      bUnknown0000_4040 : 1;                                    // 0x0000(0x0001) (MANUAL_ADD_BIT 4040)
	unsigned char                                      bUnknown0000_8080 : 1;                                    // 0x0000(0x0001) (MANUAL_ADD_BIT 8080)
	unsigned char                                      OverrideBodyLightAmbience : 1;                            // 0x0000(0x0001) (CPF_BlueprintVisible BITFIELD: 0101)
	float                                              BodyLightAmbienceLightFactor;                             // 0x0004(0x0004) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	float                                              BodyLightAmbienceBlendWithDefault;                        // 0x0008(0x0004) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	unsigned char                                      OverrideLanternAmbience : 1;                              // 0x000C(0x0001) (CPF_BlueprintVisible BITFIELD: 0101)
	float                                              LanternAmbienceLightFactor;                               // 0x0010(0x0004) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	float                                              LanternAmbienceBlendWithDefault;                          // 0x0014(0x0004) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
};

// ScriptStruct Engine.WeightedBlendable
// 0x0010
struct FWeightedBlendable
{
	float                                              Weight;                                                   // 0x0000(0x0004) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0004(0x0004) MISSED OFFSET
	class UObject*                                     Object;                                                   // 0x0008(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
};

// ScriptStruct Engine.WeightedBlendables
// 0x0010
struct FWeightedBlendables
{
	TArray<struct FWeightedBlendable>                  Array;                                                    // 0x0000(0x0010) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor)
};

// ScriptStruct Engine.PostProcessSettings
// 0x0530
struct FPostProcessSettings
{
	unsigned char                                      bUnknown0000_0101 : 1;                                    // 0x0000(0x0001) (CPF_BlueprintVisibleMANUAL_ADD_BIT 0101)
	unsigned char                                      bUnknown0000_0202 : 1;                                    // 0x0000(0x0001) (MANUAL_ADD_BIT 0202)
	unsigned char                                      bUnknown0000_0404 : 1;                                    // 0x0000(0x0001) (MANUAL_ADD_BIT 0404)
	unsigned char                                      bUnknown0000_0808 : 1;                                    // 0x0000(0x0001) (MANUAL_ADD_BIT 0808)
	unsigned char                                      bUnknown0000_1010 : 1;                                    // 0x0000(0x0001) (MANUAL_ADD_BIT 1010)
	unsigned char                                      bUnknown0000_2020 : 1;                                    // 0x0000(0x0001) (MANUAL_ADD_BIT 2020)
	unsigned char                                      bUnknown0000_4040 : 1;                                    // 0x0000(0x0001) (MANUAL_ADD_BIT 4040)
	unsigned char                                      bUnknown0000_8080 : 1;                                    // 0x0000(0x0001) (MANUAL_ADD_BIT 8080)
	unsigned char                                      bOverride_WhiteTemp : 1;                                  // 0x0000(0x0001) (CPF_BlueprintVisible BITFIELD: 0101)
	unsigned char                                      bOverride_WhiteTint : 1;                                  // 0x0000(0x0001) (CPF_BlueprintVisible BITFIELD: 0202)
	unsigned char                                      bOverride_ColorSaturation : 1;                            // 0x0000(0x0001) (CPF_BlueprintVisible BITFIELD: 0404)
	unsigned char                                      bOverride_ColorContrast : 1;                              // 0x0000(0x0001) (CPF_BlueprintVisible BITFIELD: 0808)
	unsigned char                                      bOverride_ColorGamma : 1;                                 // 0x0000(0x0001) (CPF_BlueprintVisible BITFIELD: 1010)
	unsigned char                                      bOverride_ColorGain : 1;                                  // 0x0000(0x0001) (CPF_BlueprintVisible BITFIELD: 2020)
	unsigned char                                      bOverride_ColorOffset : 1;                                // 0x0000(0x0001) (CPF_BlueprintVisible BITFIELD: 4040)
	unsigned char                                      bOverride_FilmWhitePoint : 1;                             // 0x0000(0x0001) (CPF_BlueprintVisible BITFIELD: 8080)
	unsigned char                                      bOverride_FilmSaturation : 1;                             // 0x0001(0x0001) (CPF_BlueprintVisible BITFIELD: 0101)
	unsigned char                                      bOverride_FilmChannelMixerRed : 1;                        // 0x0001(0x0001) (CPF_BlueprintVisible BITFIELD: 0202)
	unsigned char                                      bOverride_FilmChannelMixerGreen : 1;                      // 0x0001(0x0001) (CPF_BlueprintVisible BITFIELD: 0404)
	unsigned char                                      bOverride_FilmChannelMixerBlue : 1;                       // 0x0001(0x0001) (CPF_BlueprintVisible BITFIELD: 0808)
	unsigned char                                      bOverride_FilmContrast : 1;                               // 0x0001(0x0001) (CPF_BlueprintVisible BITFIELD: 1010)
	unsigned char                                      bOverride_FilmDynamicRange : 1;                           // 0x0001(0x0001) (CPF_BlueprintVisible BITFIELD: 2020)
	unsigned char                                      bOverride_FilmHealAmount : 1;                             // 0x0001(0x0001) (CPF_BlueprintVisible BITFIELD: 4040)
	unsigned char                                      bOverride_FilmToeAmount : 1;                              // 0x0001(0x0001) (CPF_BlueprintVisible BITFIELD: 8080)
	unsigned char                                      bOverride_FilmShadowTint : 1;                             // 0x0002(0x0001) (CPF_BlueprintVisible BITFIELD: 0101)
	unsigned char                                      bOverride_FilmShadowTintBlend : 1;                        // 0x0002(0x0001) (CPF_BlueprintVisible BITFIELD: 0202)
	unsigned char                                      bOverride_FilmShadowTintAmount : 1;                       // 0x0002(0x0001) (CPF_BlueprintVisible BITFIELD: 0404)
	unsigned char                                      bOverride_FilmSlope : 1;                                  // 0x0002(0x0001) (CPF_BlueprintVisible BITFIELD: 0808)
	unsigned char                                      bOverride_FilmToe : 1;                                    // 0x0002(0x0001) (CPF_BlueprintVisible BITFIELD: 1010)
	unsigned char                                      bOverride_FilmShoulder : 1;                               // 0x0002(0x0001) (CPF_BlueprintVisible BITFIELD: 2020)
	unsigned char                                      bOverride_FilmBlackClip : 1;                              // 0x0002(0x0001) (CPF_BlueprintVisible BITFIELD: 4040)
	unsigned char                                      bOverride_FilmWhiteClip : 1;                              // 0x0002(0x0001) (CPF_BlueprintVisible BITFIELD: 8080)
	unsigned char                                      bOverride_SceneColorTint : 1;                             // 0x0003(0x0001) (CPF_BlueprintVisible BITFIELD: 0101)
	unsigned char                                      bOverride_SceneFringeIntensity : 1;                       // 0x0003(0x0001) (CPF_BlueprintVisible BITFIELD: 0202)
	unsigned char                                      bOverride_SceneFringeSaturation : 1;                      // 0x0003(0x0001) (CPF_BlueprintVisible BITFIELD: 0404)
	unsigned char                                      bOverride_AmbientCubemapTint : 1;                         // 0x0003(0x0001) (CPF_BlueprintVisible BITFIELD: 0808)
	unsigned char                                      bOverride_AmbientCubemapIntensity : 1;                    // 0x0003(0x0001) (CPF_BlueprintVisible BITFIELD: 1010)
	unsigned char                                      bOverride_BloomIntensity : 1;                             // 0x0003(0x0001) (CPF_BlueprintVisible BITFIELD: 2020)
	unsigned char                                      bOverride_BloomThreshold : 1;                             // 0x0003(0x0001) (CPF_BlueprintVisible BITFIELD: 4040)
	unsigned char                                      bOverride_Bloom1Tint : 1;                                 // 0x0003(0x0001) (CPF_BlueprintVisible BITFIELD: 8080)
	unsigned char                                      bOverride_Bloom1Size : 1;                                 // 0x0004(0x0001) (CPF_BlueprintVisible BITFIELD: 0101)
	unsigned char                                      bOverride_Bloom2Size : 1;                                 // 0x0004(0x0001) (CPF_BlueprintVisible BITFIELD: 0202)
	unsigned char                                      bOverride_Bloom2Tint : 1;                                 // 0x0004(0x0001) (CPF_BlueprintVisible BITFIELD: 0404)
	unsigned char                                      bOverride_Bloom3Tint : 1;                                 // 0x0004(0x0001) (CPF_BlueprintVisible BITFIELD: 0808)
	unsigned char                                      bOverride_Bloom3Size : 1;                                 // 0x0004(0x0001) (CPF_BlueprintVisible BITFIELD: 1010)
	unsigned char                                      bOverride_Bloom4Tint : 1;                                 // 0x0004(0x0001) (CPF_BlueprintVisible BITFIELD: 2020)
	unsigned char                                      bOverride_Bloom4Size : 1;                                 // 0x0004(0x0001) (CPF_BlueprintVisible BITFIELD: 4040)
	unsigned char                                      bOverride_Bloom5Tint : 1;                                 // 0x0004(0x0001) (CPF_BlueprintVisible BITFIELD: 8080)
	unsigned char                                      bOverride_Bloom5Size : 1;                                 // 0x0005(0x0001) (CPF_BlueprintVisible BITFIELD: 0101)
	unsigned char                                      bOverride_Bloom6Tint : 1;                                 // 0x0005(0x0001) (CPF_BlueprintVisible BITFIELD: 0202)
	unsigned char                                      bOverride_Bloom6Size : 1;                                 // 0x0005(0x0001) (CPF_BlueprintVisible BITFIELD: 0404)
	unsigned char                                      bOverride_BloomSizeScale : 1;                             // 0x0005(0x0001) (CPF_BlueprintVisible BITFIELD: 0808)
	unsigned char                                      bOverride_BloomDirtMaskIntensity : 1;                     // 0x0005(0x0001) (CPF_BlueprintVisible BITFIELD: 1010)
	unsigned char                                      bOverride_BloomDirtMaskTint : 1;                          // 0x0005(0x0001) (CPF_BlueprintVisible BITFIELD: 2020)
	unsigned char                                      bOverride_BloomDirtMask : 1;                              // 0x0005(0x0001) (CPF_BlueprintVisible BITFIELD: 4040)
	unsigned char                                      bOverride_AutoExposureLowPercent : 1;                     // 0x0005(0x0001) (CPF_BlueprintVisible BITFIELD: 8080)
	unsigned char                                      bOverride_AutoExposureHighPercent : 1;                    // 0x0006(0x0001) (CPF_BlueprintVisible BITFIELD: 0101)
	unsigned char                                      bOverride_AutoExposureMinBrightness : 1;                  // 0x0006(0x0001) (CPF_BlueprintVisible BITFIELD: 0202)
	unsigned char                                      bOverride_AutoExposureMaxBrightness : 1;                  // 0x0006(0x0001) (CPF_BlueprintVisible BITFIELD: 0404)
	unsigned char                                      bOverride_AutoExposureSpeedUp : 1;                        // 0x0006(0x0001) (CPF_BlueprintVisible BITFIELD: 0808)
	unsigned char                                      bOverride_AutoExposureSpeedDown : 1;                      // 0x0006(0x0001) (CPF_BlueprintVisible BITFIELD: 1010)
	unsigned char                                      bOverride_AutoExposureBias : 1;                           // 0x0006(0x0001) (CPF_BlueprintVisible BITFIELD: 2020)
	unsigned char                                      bOverride_HistogramLogMin : 1;                            // 0x0006(0x0001) (CPF_BlueprintVisible BITFIELD: 4040)
	unsigned char                                      bOverride_HistogramLogMax : 1;                            // 0x0006(0x0001) (CPF_BlueprintVisible BITFIELD: 8080)
	unsigned char                                      bOverride_LensFlareIntensity : 1;                         // 0x0007(0x0001) (CPF_BlueprintVisible BITFIELD: 0101)
	unsigned char                                      bOverride_LensFlareTint : 1;                              // 0x0007(0x0001) (CPF_BlueprintVisible BITFIELD: 0202)
	unsigned char                                      bOverride_LensFlareTints : 1;                             // 0x0007(0x0001) (CPF_BlueprintVisible BITFIELD: 0404)
	unsigned char                                      bOverride_LensFlareBokehSize : 1;                         // 0x0007(0x0001) (CPF_BlueprintVisible BITFIELD: 0808)
	unsigned char                                      bOverride_LensFlareBokehShape : 1;                        // 0x0007(0x0001) (CPF_BlueprintVisible BITFIELD: 1010)
	unsigned char                                      bOverride_LensFlareThreshold : 1;                         // 0x0007(0x0001) (CPF_BlueprintVisible BITFIELD: 2020)
	unsigned char                                      bOverride_VignetteIntensity : 1;                          // 0x0007(0x0001) (CPF_BlueprintVisible BITFIELD: 4040)
	unsigned char                                      bOverride_GrainIntensity : 1;                             // 0x0007(0x0001) (CPF_BlueprintVisible BITFIELD: 8080)
	unsigned char                                      bOverride_GrainJitter : 1;                                // 0x0008(0x0001) (CPF_BlueprintVisible BITFIELD: 0101)
	unsigned char                                      bOverride_AmbientOcclusionIntensity : 1;                  // 0x0008(0x0001) (CPF_BlueprintVisible BITFIELD: 0202)
	unsigned char                                      bOverride_AmbientOcclusionStaticFraction : 1;             // 0x0008(0x0001) (CPF_BlueprintVisible BITFIELD: 0404)
	unsigned char                                      bOverride_AmbientOcclusionRadius : 1;                     // 0x0008(0x0001) (CPF_BlueprintVisible BITFIELD: 0808)
	unsigned char                                      bOverride_AmbientOcclusionFadeDistance : 1;               // 0x0008(0x0001) (CPF_BlueprintVisible BITFIELD: 1010)
	unsigned char                                      bOverride_AmbientOcclusionFadeRadius : 1;                 // 0x0008(0x0001) (CPF_BlueprintVisible BITFIELD: 2020)
	unsigned char                                      bOverride_AmbientOcclusionDistance : 1;                   // 0x0008(0x0001) (CPF_Deprecated BITFIELD: 4040)
	unsigned char                                      bOverride_AmbientOcclusionRadiusInWS : 1;                 // 0x0008(0x0001) (CPF_BlueprintVisible BITFIELD: 8080)
	unsigned char                                      bOverride_AmbientOcclusionPower : 1;                      // 0x0009(0x0001) (CPF_BlueprintVisible BITFIELD: 0101)
	unsigned char                                      bOverride_AmbientOcclusionBias : 1;                       // 0x0009(0x0001) (CPF_BlueprintVisible BITFIELD: 0202)
	unsigned char                                      bOverride_AmbientOcclusionQuality : 1;                    // 0x0009(0x0001) (CPF_BlueprintVisible BITFIELD: 0404)
	unsigned char                                      bOverride_AmbientOcclusionMipBlend : 1;                   // 0x0009(0x0001) (CPF_BlueprintVisible BITFIELD: 0808)
	unsigned char                                      bOverride_AmbientOcclusionMipScale : 1;                   // 0x0009(0x0001) (CPF_BlueprintVisible BITFIELD: 1010)
	unsigned char                                      bOverride_AmbientOcclusionMipThreshold : 1;               // 0x0009(0x0001) (CPF_BlueprintVisible BITFIELD: 2020)
	unsigned char                                      bOverride_AmbientOcclusionHemiIntensity : 1;              // 0x0009(0x0001) (CPF_BlueprintVisible BITFIELD: 4040)
	unsigned char                                      bOverride_AmbientOcclusionHemiPower : 1;                  // 0x0009(0x0001) (CPF_BlueprintVisible BITFIELD: 8080)
	unsigned char                                      bOverride_AmbientOcclusionHemiRadius : 1;                 // 0x000A(0x0001) (CPF_BlueprintVisible BITFIELD: 0101)
	unsigned char                                      bOverride_AmbientOcclusionHemiBlurTolerance : 1;          // 0x000A(0x0001) (CPF_BlueprintVisible BITFIELD: 0202)
	unsigned char                                      bOverride_AmbientOcclusionHemiUpsampleTolerance : 1;      // 0x000A(0x0001) (CPF_BlueprintVisible BITFIELD: 0404)
	unsigned char                                      bOverride_AmbientOcclusionHemiNoiseFilterTolerance : 1;   // 0x000A(0x0001) (CPF_BlueprintVisible BITFIELD: 0808)
	unsigned char                                      bOverride_AmbientOcclusionHemiRejectionFalloff : 1;       // 0x000A(0x0001) (CPF_BlueprintVisible BITFIELD: 1010)
	unsigned char                                      bOverride_AmbientOcclusionHemiBias : 1;                   // 0x000A(0x0001) (CPF_BlueprintVisible BITFIELD: 2020)
	unsigned char                                      bOverride_AmbientOcclusionHemiMaxDepthDownsample : 1;     // 0x000A(0x0001) (CPF_BlueprintVisible BITFIELD: 4040)
	unsigned char                                      bOverride_AmbientOcclusionHemiUseNormals : 1;             // 0x000A(0x0001) (CPF_BlueprintVisible BITFIELD: 8080)
	unsigned char                                      bOverride_AmbientOcclusionHemiCombineBeforeBlur : 1;      // 0x000B(0x0001) (CPF_BlueprintVisible BITFIELD: 0101)
	unsigned char                                      bOverride_AmbientOcclusionHemiCombineWithMultiply : 1;    // 0x000B(0x0001) (CPF_BlueprintVisible BITFIELD: 0202)
	unsigned char                                      bOverride_MinOverdrawCount : 1;                           // 0x000B(0x0001) (CPF_BlueprintVisible BITFIELD: 0404)
	unsigned char                                      bOverride_MaxOverdrawCount : 1;                           // 0x000B(0x0001) (CPF_BlueprintVisible BITFIELD: 0808)
	unsigned char                                      bOverride_MinOverdrawColour : 1;                          // 0x000B(0x0001) (CPF_BlueprintVisible BITFIELD: 1010)
	unsigned char                                      bOverride_MaxOverdrawColour : 1;                          // 0x000B(0x0001) (CPF_BlueprintVisible BITFIELD: 2020)
	unsigned char                                      bOverride_LPVIntensity : 1;                               // 0x000B(0x0001) (CPF_BlueprintVisible BITFIELD: 4040)
	unsigned char                                      bOverride_LPVDirectionalOcclusionIntensity : 1;           // 0x000B(0x0001) ( BITFIELD: 8080)
	unsigned char                                      bOverride_LPVDirectionalOcclusionRadius : 1;              // 0x000C(0x0001) ( BITFIELD: 0101)
	unsigned char                                      bOverride_LPVDiffuseOcclusionExponent : 1;                // 0x000C(0x0001) ( BITFIELD: 0202)
	unsigned char                                      bOverride_LPVSpecularOcclusionExponent : 1;               // 0x000C(0x0001) ( BITFIELD: 0404)
	unsigned char                                      bOverride_LPVDiffuseOcclusionIntensity : 1;               // 0x000C(0x0001) ( BITFIELD: 0808)
	unsigned char                                      bOverride_LPVSpecularOcclusionIntensity : 1;              // 0x000C(0x0001) ( BITFIELD: 1010)
	unsigned char                                      bOverride_LPVSize : 1;                                    // 0x000C(0x0001) (CPF_BlueprintVisible BITFIELD: 2020)
	unsigned char                                      bOverride_LPVSecondaryOcclusionIntensity : 1;             // 0x000C(0x0001) (CPF_BlueprintVisible BITFIELD: 4040)
	unsigned char                                      bOverride_LPVSecondaryBounceIntensity : 1;                // 0x000C(0x0001) (CPF_BlueprintVisible BITFIELD: 8080)
	unsigned char                                      bOverride_LPVGeometryVolumeBias : 1;                      // 0x000D(0x0001) (CPF_BlueprintVisible BITFIELD: 0101)
	unsigned char                                      bOverride_LPVVplInjectionBias : 1;                        // 0x000D(0x0001) (CPF_BlueprintVisible BITFIELD: 0202)
	unsigned char                                      bOverride_LPVEmissiveInjectionIntensity : 1;              // 0x000D(0x0001) (CPF_BlueprintVisible BITFIELD: 0404)
	unsigned char                                      bOverride_LPVWorldRef : 1;                                // 0x000D(0x0001) (CPF_BlueprintVisible BITFIELD: 0808)
	unsigned char                                      bOverride_IndirectLightingColor : 1;                      // 0x000D(0x0001) (CPF_BlueprintVisible BITFIELD: 1010)
	unsigned char                                      bOverride_IndirectLightingIntensity : 1;                  // 0x000D(0x0001) (CPF_BlueprintVisible BITFIELD: 2020)
	unsigned char                                      bOverride_ColorGradingIntensity : 1;                      // 0x000D(0x0001) (CPF_BlueprintVisible BITFIELD: 4040)
	unsigned char                                      bOverride_ColorGradingLUT : 1;                            // 0x000D(0x0001) (CPF_BlueprintVisible BITFIELD: 8080)
	unsigned char                                      bOverride_DepthOfFieldFocalDistance : 1;                  // 0x000E(0x0001) (CPF_BlueprintVisible BITFIELD: 0101)
	unsigned char                                      bOverride_DepthOfFieldFstop : 1;                          // 0x000E(0x0001) (CPF_BlueprintVisible BITFIELD: 0202)
	unsigned char                                      bOverride_DepthOfFieldDepthBlurRadius : 1;                // 0x000E(0x0001) (CPF_BlueprintVisible BITFIELD: 0404)
	unsigned char                                      bOverride_DepthOfFieldDepthBlurAmount : 1;                // 0x000E(0x0001) (CPF_BlueprintVisible BITFIELD: 0808)
	unsigned char                                      bOverride_DepthOfFieldFocalRegion : 1;                    // 0x000E(0x0001) (CPF_BlueprintVisible BITFIELD: 1010)
	unsigned char                                      bOverride_DepthOfFieldNearTransitionRegion : 1;           // 0x000E(0x0001) (CPF_BlueprintVisible BITFIELD: 2020)
	unsigned char                                      bOverride_DepthOfFieldFarTransitionRegion : 1;            // 0x000E(0x0001) (CPF_BlueprintVisible BITFIELD: 4040)
	unsigned char                                      bOverride_DepthOfFieldScale : 1;                          // 0x000E(0x0001) (CPF_BlueprintVisible BITFIELD: 8080)
	unsigned char                                      bOverride_DepthOfFieldMaxBokehSize : 1;                   // 0x000F(0x0001) (CPF_BlueprintVisible BITFIELD: 0101)
	unsigned char                                      bOverride_DepthOfFieldNearBlurSize : 1;                   // 0x000F(0x0001) (CPF_BlueprintVisible BITFIELD: 0202)
	unsigned char                                      bOverride_DepthOfFieldFarBlurSize : 1;                    // 0x000F(0x0001) (CPF_BlueprintVisible BITFIELD: 0404)
	unsigned char                                      bOverride_DepthOfFieldMethod : 1;                         // 0x000F(0x0001) (CPF_BlueprintVisible BITFIELD: 0808)
	unsigned char                                      bOverride_DepthOfFieldBokehShape : 1;                     // 0x000F(0x0001) (CPF_BlueprintVisible BITFIELD: 1010)
	unsigned char                                      bOverride_DepthOfFieldOcclusion : 1;                      // 0x000F(0x0001) (CPF_BlueprintVisible BITFIELD: 2020)
	unsigned char                                      bOverride_DepthOfFieldColorThreshold : 1;                 // 0x000F(0x0001) (CPF_BlueprintVisible BITFIELD: 4040)
	unsigned char                                      bOverride_DepthOfFieldSizeThreshold : 1;                  // 0x000F(0x0001) (CPF_BlueprintVisible BITFIELD: 8080)
	unsigned char                                      bOverride_DepthOfFieldSkyFocusDistance : 1;               // 0x0010(0x0001) (CPF_BlueprintVisible BITFIELD: 0101)
	unsigned char                                      bOverride_MotionBlurAmount : 1;                           // 0x0010(0x0001) (CPF_BlueprintVisible BITFIELD: 0202)
	unsigned char                                      bOverride_MotionBlurMax : 1;                              // 0x0010(0x0001) (CPF_BlueprintVisible BITFIELD: 0404)
	unsigned char                                      bOverride_MotionBlurPerObjectSize : 1;                    // 0x0010(0x0001) (CPF_BlueprintVisible BITFIELD: 0808)
	unsigned char                                      bOverride_ScreenPercentage : 1;                           // 0x0010(0x0001) (CPF_BlueprintVisible BITFIELD: 1010)
	unsigned char                                      bOverride_AntiAliasingMethod : 1;                         // 0x0010(0x0001) (CPF_BlueprintVisible BITFIELD: 2020)
	unsigned char                                      bOverride_ScreenSpaceReflectionIntensity : 1;             // 0x0010(0x0001) (CPF_BlueprintVisible BITFIELD: 4040)
	unsigned char                                      bOverride_ScreenSpaceReflectionQuality : 1;               // 0x0010(0x0001) (CPF_BlueprintVisible BITFIELD: 8080)
