#pragma once

// SOT: Sea of Thieves (1.0) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x4)
#endif

namespace SDK
{
//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// Class Engine.Actor
// 0x0440 (0x0468 - 0x0028)
class AActor : public UObject
{
public:
	struct FActorTickFunction                          PrimaryActorTick;                                         // 0x0028(0x0050) (CPF_Edit, CPF_DisableEditOnInstance)
	float                                              CustomTimeDilation;                                       // 0x0078(0x0004) (CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	unsigned char                                      bAllowRemovalFromServerWhenCollisionMerged : 1;           // 0x007C(0x0001) (CPF_Edit BITFIELD: 0101)
	unsigned char                                      bHidden : 1;                                              // 0x007C(0x0001) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_Net BITFIELD: 0202)
	unsigned char                                      bNetTemporary : 1;                                        // 0x007C(0x0001) ( BITFIELD: 0404)
	unsigned char                                      bNetStartup : 1;                                          // 0x007C(0x0001) ( BITFIELD: 0808)
	unsigned char                                      bOnlyRelevantToOwner : 1;                                 // 0x007C(0x0001) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_DisableEditOnInstance BITFIELD: 1010)
	unsigned char                                      bAlwaysRelevant : 1;                                      // 0x007C(0x0001) (CPF_Edit, CPF_BlueprintVisible, CPF_DisableEditOnInstance BITFIELD: 2020)
	unsigned char                                      bReplicateMovement : 1;                                   // 0x007C(0x0001) (CPF_Edit, CPF_Net, CPF_DisableEditOnInstance BITFIELD: 4040)
	unsigned char                                      bTearOff : 1;                                             // 0x007C(0x0001) ( BITFIELD: 8080)
	unsigned char                                      bExchangedRoles : 1;                                      // 0x007D(0x0001) (CPF_Transient BITFIELD: 0101)
	unsigned char                                      bPendingNetUpdate : 1;                                    // 0x007D(0x0001) (CPF_Transient BITFIELD: 0202)
	unsigned char                                      bNetLoadOnClient : 1;                                     // 0x007D(0x0001) (CPF_Edit, CPF_DisableEditOnInstance BITFIELD: 0404)
	unsigned char                                      bNetUseOwnerRelevancy : 1;                                // 0x007D(0x0001) (CPF_Edit, CPF_BlueprintVisible, CPF_DisableEditOnInstance BITFIELD: 0808)
	unsigned char                                      bBlockInput : 1;                                          // 0x007D(0x0001) (CPF_Edit, CPF_DisableEditOnInstance BITFIELD: 1010)
	unsigned char                                      bUnknown007D_4040 : 1;                                    // 0x007D(0x0001) (MANUAL_ADD_BIT 4040)
	unsigned char                                      bActorEnableCollision : 1;                                // 0x007D(0x0001) ( BITFIELD: 8080)
	unsigned char                                      bUnknown007E_0101 : 1;                                    // 0x007E(0x0001) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_DisableEditOnInstanceMANUAL_ADD_BIT 0101)
	unsigned char                                      bUnknown007E_0202 : 1;                                    // 0x007E(0x0001) (MANUAL_ADD_BIT 0202)
	unsigned char                                      bUnknown007E_0404 : 1;                                    // 0x007E(0x0001) (MANUAL_ADD_BIT 0404)
	unsigned char                                      bReplicates : 1;                                          // 0x007E(0x0001) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_DisableEditOnInstance BITFIELD: 0808)
	struct FScriptMulticastDelegate                    OnPreNetOwnershipChange;                                  // 0x0080(0x0010) (CPF_ZeroConstructor, CPF_InstancedReference, CPF_BlueprintAssignable)
	TEnumAsByte<ENetRole>                              RemoteRole;                                               // 0x0090(0x0001) (CPF_Net, CPF_ZeroConstructor, CPF_Transient, CPF_IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0091(0x0007) MISSED OFFSET
	class AActor*                                      Owner;                                                    // 0x0098(0x0008) (CPF_Net, CPF_ZeroConstructor, CPF_IsPlainOldData)
	TEnumAsByte<EActorSpawnRestrictions>               SpawnRestrictions;                                        // 0x00A0(0x0001) (CPF_Edit, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_IsPlainOldData)
	struct FRepMovement                                ReplicatedMovement;                                       // 0x00A4(0x0034) (CPF_Edit, CPF_Net, CPF_DisableEditOnInstance)
	struct FRepAttachment                              AttachmentReplication;                                    // 0x00D8(0x0040) (CPF_Net, CPF_Transient)
	TEnumAsByte<ENetRole>                              Role;                                                     // 0x0118(0x0001) (CPF_Net, CPF_ZeroConstructor, CPF_IsPlainOldData)
	TEnumAsByte<EAutoReceiveInput>                     AutoReceiveInput;                                         // 0x011A(0x0001) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData)
	int                                                InputPriority;                                            // 0x011C(0x0004) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData)
	class UInputComponent*                             InputComponent;                                           // 0x0120(0x0008) (CPF_ExportObject, CPF_ZeroConstructor, CPF_InstancedReference, CPF_IsPlainOldData)
	TEnumAsByte<EInputConsumeOptions>                  InputConsumeOption;                                       // 0x0128(0x0001) (CPF_ZeroConstructor, CPF_Deprecated, CPF_IsPlainOldData)
	float                                              NetCullDistanceSquared;                                   // 0x012C(0x0004) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_IsPlainOldData)
	int                                                NetTag;                                                   // 0x0130(0x0004) (CPF_ZeroConstructor, CPF_Transient, CPF_IsPlainOldData)
	float                                              NetUpdateTime;                                            // 0x0134(0x0004) (CPF_ZeroConstructor, CPF_IsPlainOldData)
	float                                              NetUpdateFrequency;                                       // 0x0138(0x0004) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_IsPlainOldData)
	float                                              NetPriority;                                              // 0x013C(0x0004) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_IsPlainOldData)
	float                                              LastNetUpdateTime;                                        // 0x0140(0x0004) (CPF_ZeroConstructor, CPF_Transient, CPF_IsPlainOldData)
	struct FName                                       NetDriverName;                                            // 0x0144(0x0008) (CPF_ZeroConstructor, CPF_IsPlainOldData)
	unsigned char                                      bAutoDestroyWhenFinished : 1;                             // 0x014C(0x0001) (CPF_BlueprintVisible BITFIELD: 0101)
	unsigned char                                      bCanBeDamaged : 1;                                        // 0x014C(0x0001) (CPF_Edit, CPF_BlueprintVisible BITFIELD: 0202)
	unsigned char                                      bActorIsBeingDestroyed : 1;                               // 0x014C(0x0001) (CPF_Transient, CPF_DuplicateTransient BITFIELD: 0404)
	unsigned char                                      bCollideWhenPlacing : 1;                                  // 0x014C(0x0001) ( BITFIELD: 0808)
	unsigned char                                      bFindCameraComponentWhenViewTarget : 1;                   // 0x014C(0x0001) (CPF_Edit, CPF_BlueprintVisible BITFIELD: 1010)
	unsigned char                                      bRelevantForNetworkReplays : 1;                           // 0x014C(0x0001) ( BITFIELD: 2020)
	TEnumAsByte<ESpawnActorCollisionHandlingMethod>    SpawnCollisionHandlingMethod;                             // 0x0150(0x0001) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	unsigned char                                      UnknownData01[0x7];                                       // 0x0151(0x0007) MISSED OFFSET
	class APawn*                                       Instigator;                                               // 0x0158(0x0008) (CPF_BlueprintVisible, CPF_Net, CPF_ZeroConstructor, CPF_IsPlainOldData)
	TArray<class AActor*>                              Children;                                                 // 0x0160(0x0010) (CPF_ZeroConstructor, CPF_Transient)
	class USceneComponent*                             RootComponent;                                            // 0x0170(0x0008) (CPF_ExportObject, CPF_ZeroConstructor, CPF_InstancedReference, CPF_IsPlainOldData)
	TArray<class AMatineeActor*>                       ControllingMatineeActors;                                 // 0x0178(0x0010) (CPF_ZeroConstructor, CPF_Transient)
	float                                              InitialLifeSpan;                                          // 0x0188(0x0004) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_IsPlainOldData)
	unsigned char                                      UnknownData02[0x4];                                       // 0x018C(0x0004) MISSED OFFSET
	unsigned char                                      bAllowReceiveTickEventOnDedicatedServer : 1;              // 0x0190(0x0001) ( BITFIELD: 0101)
	unsigned char                                      UnknownData03[0x7];                                       // 0x0191(0x0007) MISSED OFFSET
	TArray<struct FName>                               Layers;                                                   // 0x0198(0x0010) (CPF_ZeroConstructor)
	struct FActorPtr                                   ParentComponentActor;                                     // 0x01A8(0x0008)
	TArray<TWeakObjectPtr<class AActor>>               ChildComponentActors;                                     // 0x01B0(0x0010) (CPF_ZeroConstructor)
	unsigned char                                      bUnknown01C0_0101 : 1;                                    // 0x01C0(0x0001) (MANUAL_ADD_BIT 0101)
	unsigned char                                      bUnknown01C0_0202 : 1;                                    // 0x01C0(0x0001) (MANUAL_ADD_BIT 0202)
	unsigned char                                      bUnknown01C0_0404 : 1;                                    // 0x01C0(0x0001) (MANUAL_ADD_BIT 0404)
	unsigned char                                      bUnknown01C0_0808 : 1;                                    // 0x01C0(0x0001) (MANUAL_ADD_BIT 0808)
	unsigned char                                      bActorSeamlessTraveled : 1;                               // 0x01C0(0x0001) ( BITFIELD: 1010)
	unsigned char                                      bIgnoresOriginShifting : 1;                               // 0x01C0(0x0001) (CPF_Edit BITFIELD: 2020)
	unsigned char                                      bEnableAutoLODGeneration : 1;                             // 0x01C0(0x0001) (CPF_Edit BITFIELD: 4040)
	unsigned char                                      UnknownData04[0x7];                                       // 0x01C1(0x0007) MISSED OFFSET
	TArray<struct FName>                               Tags;                                                     // 0x01C8(0x0010) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor)
	struct FName                                       Feature;                                                  // 0x01D8(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_IsPlainOldData)
	uint64_t                                           HiddenEditorViews;                                        // 0x01E0(0x0008) (CPF_ZeroConstructor, CPF_Transient, CPF_IsPlainOldData)
	struct FScriptMulticastDelegate                    OnTakeAnyDamage;                                          // 0x01E8(0x0010) (CPF_ZeroConstructor, CPF_InstancedReference, CPF_BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnTakePointDamage;                                        // 0x01F8(0x0010) (CPF_ZeroConstructor, CPF_InstancedReference, CPF_BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnActorBeginOverlap;                                      // 0x0208(0x0010) (CPF_ZeroConstructor, CPF_InstancedReference, CPF_BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnActorEndOverlap;                                        // 0x0218(0x0010) (CPF_ZeroConstructor, CPF_InstancedReference, CPF_BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnBeginCursorOver;                                        // 0x0228(0x0010) (CPF_ZeroConstructor, CPF_InstancedReference, CPF_BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnEndCursorOver;                                          // 0x0238(0x0010) (CPF_ZeroConstructor, CPF_InstancedReference, CPF_BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnClicked;                                                // 0x0248(0x0010) (CPF_ZeroConstructor, CPF_InstancedReference, CPF_BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnReleased;                                               // 0x0258(0x0010) (CPF_ZeroConstructor, CPF_InstancedReference, CPF_BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnInputTouchBegin;                                        // 0x0268(0x0010) (CPF_ZeroConstructor, CPF_InstancedReference, CPF_BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnInputTouchEnd;                                          // 0x0278(0x0010) (CPF_ZeroConstructor, CPF_InstancedReference, CPF_BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnInputTouchEnter;                                        // 0x0288(0x0010) (CPF_ZeroConstructor, CPF_InstancedReference, CPF_BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnInputTouchLeave;                                        // 0x0298(0x0010) (CPF_ZeroConstructor, CPF_InstancedReference, CPF_BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnActorHit;                                               // 0x02A8(0x0010) (CPF_ZeroConstructor, CPF_InstancedReference, CPF_BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnDestroyed;                                              // 0x02B8(0x0010) (CPF_ZeroConstructor, CPF_InstancedReference, CPF_BlueprintAssignable)
	unsigned char                                      UnknownData05[0x58];                                      // 0x02C8(0x0058) MISSED OFFSET
	struct FScriptMulticastDelegate                    OnEndPlay;                                                // 0x0320(0x0010) (CPF_ZeroConstructor, CPF_InstancedReference, CPF_BlueprintAssignable)
	unsigned char                                      bDoOverlapNotifiesOnLoad;                                 // 0x0330(0x0001) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData)
	unsigned char                                      UnknownData06[0xBF];                                      // 0x0331(0x00BF) MISSED OFFSET
	TArray<class UActorComponent*>                     BlueprintCreatedComponents;                               // 0x03F0(0x0010) (CPF_ExportObject, CPF_ZeroConstructor)
	TArray<class UActorComponent*>                     InstanceComponents;                                       // 0x0400(0x0010) (CPF_ExportObject, CPF_ZeroConstructor)
	unsigned char                                      UnknownData07[0x58];                                      // 0x0410(0x0058) MISSED OFFSET

	static UClass* StaticClass()
	{
		static UClass* ptr = 0;
		if(ptr == 0) { ptr = UObject::FindClass(_xor_("Class Engine.Actor")); }
		return ptr;
	}


	void UserConstructionScript();
	void TearOff();
	void SnapRootComponentTo(class AActor* InParentActor, const struct FName& InSocketName);
	void SetTickGroup(TEnumAsByte<ETickingGroup> NewTickGroup);
	void SetTickableWhenPaused(bool bTickableWhenPaused);
	void SetReplicates(bool bInReplicates);
	void SetReplicateMovement(bool bInReplicateMovement);
	void SetOwner(class AActor* NewOwner);
	void SetLifeSpan(float InLifespan);
	void SetIgnoreNetTransformUpdates(bool bInIgnoreNetTransformUpdates);
	void SetActorTickEnabled(bool bEnabled);
	void SetActorScale3D(const struct FVector& NewScale3D);
	bool SetActorRotation(const struct FRotator& NewRotation);
	void SetActorRelativeScale3D(const struct FVector& NewRelativeScale);
	void SetActorHiddenInGame(bool bNewHidden);
	void SetActorEnableCollision(bool bNewActorEnableCollision);
	void RemoveTickPrerequisiteComponent(class UActorComponent* PrerequisiteComponent);
	void RemoveTickPrerequisiteActor(class AActor* PrerequisiteActor);
	void ReceiveTick(float DeltaSeconds);
	void ReceiveRadialDamage(float DamageReceived, class UDamageType* DamageType, const struct FVector& Origin, const struct FHitResult& HitInfo, class AController* InstigatedBy, class AActor* DamageCauser);
	void ReceivePointDamage(float Damage, class UDamageType* DamageType, const struct FVector& HitLocation, const struct FVector& HitNormal, class UPrimitiveComponent* HitComponent, const struct FName& BoneName, const struct FVector& ShotFromDirection, class AController* InstigatedBy, class AActor* DamageCauser);
	void ReceiveHit(class UPrimitiveComponent* MyComp, class AActor* Other, class UPrimitiveComponent* OtherComp, bool bSelfMoved, const struct FVector& HitLocation, const struct FVector& HitNormal, const struct FVector& NormalImpulse, const struct FHitResult& Hit);
	void ReceiveEndPlay(TEnumAsByte<EEndPlayReason> EndPlayReason);
	void ReceiveDestroyed();
	void ReceiveBeginPlay();
	void ReceiveAnyDamage(float Damage, class UDamageType* DamageType, class AController* InstigatedBy, class AActor* DamageCauser);
	void ReceiveActorOnReleased();
	void ReceiveActorOnInputTouchLeave(TEnumAsByte<ETouchIndex> FingerIndex);
	void ReceiveActorOnInputTouchEnter(TEnumAsByte<ETouchIndex> FingerIndex);
	void ReceiveActorOnInputTouchEnd(TEnumAsByte<ETouchIndex> FingerIndex);
	void ReceiveActorOnInputTouchBegin(TEnumAsByte<ETouchIndex> FingerIndex);
	void ReceiveActorOnClicked();
	void ReceiveActorEndOverlap(class AActor* OtherActor);
	void ReceiveActorEndCursorOver();
	void ReceiveActorBeginOverlap(class AActor* OtherActor);
	void ReceiveActorBeginCursorOver();
	void OnRep_Role();
	void OnRep_ReplicateMovement();
	void OnRep_ReplicatedMovement();
	void OnRep_Instigator();
	void OnRep_AttachmentReplication();
	void OnDestroyedDynamicMulticastEvent__DelegateSignature(class AActor* DeletedActor);
	void MakeNoise(float Loudness, class APawn* NoiseInstigator, const struct FVector& NoiseLocation, float MaxRange, const struct FName& Tag);
	class UMaterialInstanceDynamic* MakeMIDForMaterial(class UMaterialInterface* Parent);
	bool K2_TeleportTo(const struct FVector& DestLocation, const struct FRotator& DestRotation);
	bool K2_SetActorTransform(const struct FTransform& NewTransform, bool bSweep, bool bTeleport, struct FHitResult* SweepHitResult);
	void K2_SetActorRelativeTransform(const struct FTransform& NewRelativeTransform, bool bSweep, bool bTeleport, struct FHitResult* SweepHitResult);
	void K2_SetActorRelativeRotation(const struct FRotator& NewRelativeRotation, bool bSweep, bool bTeleport, struct FHitResult* SweepHitResult);
	void K2_SetActorRelativeLocation(const struct FVector& NewRelativeLocation, bool bSweep, bool bTeleport, struct FHitResult* SweepHitResult);
	bool K2_SetActorLocationAndRotation(const struct FVector& NewLocation, const struct FRotator& NewRotation, bool bSweep, bool bTeleport, struct FHitResult* SweepHitResult);
	bool K2_SetActorLocation(const struct FVector& NewLocation, bool bSweep, bool bTeleport, struct FHitResult* SweepHitResult);
	void K2_OnReset();
	void K2_OnEndViewTarget(class APlayerController* PC);
	void K2_OnBecomeViewTarget(class APlayerController* PC);
	class USceneComponent* K2_GetRootComponent();
	struct FRotator K2_GetActorRotation();
	struct FVector K2_GetActorLocation();
	void K2_DestroyComponent(class UActorComponent* Component);
	void K2_DestroyActor();
	void K2_AttachRootComponentToActor(class AActor* InParentActor, const struct FName& InSocketName, TEnumAsByte<EAttachLocation> AttachLocationType, bool bWeldSimulatedBodies);
	void K2_AttachRootComponentTo(class USceneComponent* InParent, const struct FName& InSocketName, TEnumAsByte<EAttachLocation> AttachLocationType, bool bWeldSimulatedBodies);
	void K2_AddActorWorldTransform(const struct FTransform& DeltaTransform, bool bSweep, bool bTeleport, struct FHitResult* SweepHitResult);
	void K2_AddActorWorldRotation(const struct FRotator& DeltaRotation, bool bSweep, bool bTeleport, struct FHitResult* SweepHitResult);
	void K2_AddActorWorldOffset(const struct FVector& DeltaLocation, bool bSweep, bool bTeleport, struct FHitResult* SweepHitResult);
	void K2_AddActorLocalTransform(const struct FTransform& NewTransform, bool bSweep, bool bTeleport, struct FHitResult* SweepHitResult);
	void K2_AddActorLocalRotation(const struct FRotator& DeltaRotation, bool bSweep, bool bTeleport, struct FHitResult* SweepHitResult);
	void K2_AddActorLocalOffset(const struct FVector& DeltaLocation, bool bSweep, bool bTeleport, struct FHitResult* SweepHitResult);
	bool IsOverlappingActor(class AActor* Other);
	bool IsChildActor();
	bool IsActorTickEnabled();
	bool IsActorBeingDestroyed();
	bool HasNetOwner();
	bool HasAuthority();
	float GetVerticalDistanceTo(class AActor* OtherActor);
	struct FVector GetVelocity();
	struct FTransform GetTransform();
	bool GetTickableWhenPaused();
	class AActor* GetParentActor();
	class AActor* GetOwner();
	void GetOverlappingComponents(TArray<class UPrimitiveComponent*>* OverlappingComponents);
	void GetOverlappingActors(class UClass* ClassFilter, TArray<class AActor*>* OverlappingActors);
	float GetLifeSpan();
	class UObject* GetInterfaceImplementer(class UClass* InterfaceClass);
	class AController* GetInstigatorController();
	class APawn* GetInstigator();
	struct FVector GetInputVectorAxisValue(const struct FKey& InputAxisKey);
	float GetInputAxisValue(const struct FName& InputAxisName);
	float GetInputAxisKeyValue(const struct FKey& InputAxisKey);
	float GetHorizontalDotProductTo(class AActor* OtherActor);
	float GetHorizontalDistanceTo(class AActor* OtherActor);
	float GetDotProductTo(class AActor* OtherActor);
	float GetDistanceTo(class AActor* OtherActor);
	TArray<class UActorComponent*> GetComponentsByTag(class UClass* ComponentClass, const struct FName& Tag);
	TArray<class UActorComponent*> GetComponentsByClass(class UClass* ComponentClass);
	void GetComponentInterfacesByClass(class UClass* InterfaceClass, TArray<class UActorComponent*>* OutInterfaces);
	class UActorComponent* GetComponentInterfaceByClass(class UClass* InterfaceClass);
	class UActorComponent* GetComponentByClass(class UClass* ComponentClass);
	class AActor* GetAttachParentActor();
	struct FVector GetActorUpVector();
	float GetActorTimeDilation();
	struct FVector GetActorScale3D();
	struct FVector GetActorRightVector();
	struct FVector GetActorRelativeScale3D();
	struct FVector GetActorForwardVector();
	void GetActorEyesViewPoint(struct FVector* OutLocation, struct FRotator* OutRotation);
	bool GetActorEnableCollision();
	void GetActorBounds(bool bOnlyCollidingComponents, struct FVector* Origin, struct FVector* BoxExtent);
	void ForceNetUpdate();
	void FlushNetDormancy();
	void EnableInput(class APlayerController* PlayerController);
	void DisableInput(class APlayerController* PlayerController);
	void DetachRootComponentFromParent(bool bMaintainWorldPosition);
	void AttachRootComponentToNoReplication(class USceneComponent* InParent, const struct FName& InSocketName, TEnumAsByte<EAttachLocation> AttachLocationType, bool bWeldSimulatedBodies);
	void AttachActorToActorNoReplication(class AActor* InParentActor, const struct FName& InSocketName, bool bWeldSimulatedBodies);
	void AddTickPrerequisiteComponent(class UActorComponent* PrerequisiteComponent);
	void AddTickPrerequisiteActor(class AActor* PrerequisiteActor);
	class UActorComponent* AddComponent(const struct FName& TemplateName, bool bManualAttachment, const struct FTransform& RelativeTransform, class UObject* ComponentTemplateContext);
	bool ActorHasTag(const struct FName& Tag);
};


// Class Engine.DataAsset
// 0x0000 (0x0028 - 0x0028)
class UDataAsset : public UObject
{
public:

	static UClass* StaticClass()
	{
		static UClass* ptr = 0;
		if(ptr == 0) { ptr = UObject::FindClass(_xor_("Class Engine.DataAsset")); }
		return ptr;
	}

};


// Class Engine.BlueprintFunctionLibrary
// 0x0000 (0x0028 - 0x0028)
class UBlueprintFunctionLibrary : public UObject
{
public:

	static UClass* StaticClass()
	{
		static UClass* ptr = 0;
		if(ptr == 0) { ptr = UObject::FindClass(_xor_("Class Engine.BlueprintFunctionLibrary")); }
		return ptr;
	}

};


// Class Engine.ActorComponent
// 0x00A8 (0x00D0 - 0x0028)
class UActorComponent : public UObject
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0028(0x0008) MISSED OFFSET
	struct FActorComponentTickFunction                 PrimaryComponentTick;                                     // 0x0030(0x0050) (CPF_Edit, CPF_DisableEditOnInstance)
	TArray<struct FName>                               ComponentTags;                                            // 0x0080(0x0010) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor)
	TArray<class UAssetUserData*>                      AssetUserData;                                            // 0x0090(0x0010) (CPF_ExportObject, CPF_ZeroConstructor)
	unsigned char                                      bUnknown00A0_0101 : 1;                                    // 0x00A0(0x0001) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_Net, CPF_DisableEditOnInstanceMANUAL_ADD_BIT 0101)
	unsigned char                                      bUnknown00A0_0202 : 1;                                    // 0x00A0(0x0001) (MANUAL_ADD_BIT 0202)
	unsigned char                                      bUnknown00A0_0404 : 1;                                    // 0x00A0(0x0001) (MANUAL_ADD_BIT 0404)
	unsigned char                                      bReplicates : 1;                                          // 0x00A0(0x0001) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_Net, CPF_DisableEditOnInstance BITFIELD: 0808)
	unsigned char                                      bNetAddressable : 1;                                      // 0x00A0(0x0001) ( BITFIELD: 1010)
	unsigned char                                      bUnknown00A0_2020 : 1;                                    // 0x00A0(0x0001) (CPF_DeprecatedMANUAL_ADD_BIT 2020)
	unsigned char                                      bUnknown00A0_4040 : 1;                                    // 0x00A0(0x0001) (MANUAL_ADD_BIT 4040)
	unsigned char                                      bUnknown00A0_8080 : 1;                                    // 0x00A0(0x0001) (MANUAL_ADD_BIT 8080)
	unsigned char                                      bUnknown00A1_0101 : 1;                                    // 0x00A1(0x0001) (MANUAL_ADD_BIT 0101)
	unsigned char                                      bUnknown00A1_0202 : 1;                                    // 0x00A1(0x0001) (MANUAL_ADD_BIT 0202)
	unsigned char                                      bUnknown00A1_0404 : 1;                                    // 0x00A1(0x0001) (MANUAL_ADD_BIT 0404)
	unsigned char                                      bUnknown00A1_0808 : 1;                                    // 0x00A1(0x0001) (MANUAL_ADD_BIT 0808)
	unsigned char                                      bUnknown00A1_1010 : 1;                                    // 0x00A1(0x0001) (MANUAL_ADD_BIT 1010)
	unsigned char                                      bUnknown00A1_2020 : 1;                                    // 0x00A1(0x0001) (MANUAL_ADD_BIT 2020)
	unsigned char                                      bCreatedByConstructionScript : 1;                         // 0x00A1(0x0001) (CPF_Deprecated BITFIELD: 4040)
	unsigned char                                      bInstanceComponent : 1;                                   // 0x00A1(0x0001) (CPF_Deprecated BITFIELD: 8080)
	unsigned char                                      bAutoActivate : 1;                                        // 0x00A2(0x0001) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly BITFIELD: 0101)
	unsigned char                                      bIsActive : 1;                                            // 0x00A2(0x0001) (CPF_Net, CPF_Transient BITFIELD: 0202)
	unsigned char                                      bEditableWhenInherited : 1;                               // 0x00A2(0x0001) (CPF_Edit, CPF_DisableEditOnInstance BITFIELD: 0404)
	unsigned char                                      bUnknown00A2_0808 : 1;                                    // 0x00A2(0x0001) (MANUAL_ADD_BIT 0808)
	unsigned char                                      bWantsBeginPlay : 1;                                      // 0x00A2(0x0001) ( BITFIELD: 1010)
	unsigned char                                      bUnknown00A2_2020 : 1;                                    // 0x00A2(0x0001) (CPF_EditMANUAL_ADD_BIT 2020)
	unsigned char                                      bUnknown00A2_4040 : 1;                                    // 0x00A2(0x0001) (MANUAL_ADD_BIT 4040)
	unsigned char                                      bUnknown00A2_8080 : 1;                                    // 0x00A2(0x0001) (MANUAL_ADD_BIT 8080)
	unsigned char                                      bUnknown00A3_0101 : 1;                                    // 0x00A3(0x0001) (MANUAL_ADD_BIT 0101)
	unsigned char                                      bUnknown00A3_0202 : 1;                                    // 0x00A3(0x0001) (MANUAL_ADD_BIT 0202)
	unsigned char                                      bUnknown00A3_0404 : 1;                                    // 0x00A3(0x0001) (MANUAL_ADD_BIT 0404)
	unsigned char                                      bNeedsLoadForClient : 1;                                  // 0x00A3(0x0001) (CPF_Edit BITFIELD: 0808)
	unsigned char                                      bNeedsLoadForServer : 1;                                  // 0x00A3(0x0001) (CPF_Edit BITFIELD: 1010)
	TEnumAsByte<EComponentCreationMethod>              CreationMethod;                                           // 0x00A4(0x0001) (CPF_ZeroConstructor, CPF_IsPlainOldData)
	unsigned char                                      UnknownData01[0xB];                                       // 0x00A5(0x000B) MISSED OFFSET
	TArray<struct FSimpleMemberReference>              UCSModifiedProperties;                                    // 0x00B0(0x0010) (CPF_ZeroConstructor)
	unsigned char                                      UnknownData02[0x10];                                      // 0x00C0(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static UClass* ptr = 0;
		if(ptr == 0) { ptr = UObject::FindClass(_xor_("Class Engine.ActorComponent")); }
		return ptr;
	}


	void ToggleActive();
	void SetTickGroup(TEnumAsByte<ETickingGroup> NewTickGroup);
	void SetTickableWhenPaused(bool bTickableWhenPaused);
	void SetIsReplicated(bool ShouldReplicate);
	void SetComponentTickEnabled(bool bEnabled);
	void SetActive(bool bNewActive, bool bReset);
	void RemoveTickPrerequisiteComponent(class UActorComponent* PrerequisiteComponent);
	void RemoveTickPrerequisiteActor(class AActor* PrerequisiteActor);
	void ReceiveTick(float DeltaSeconds);
	void ReceiveEndPlay(TEnumAsByte<EEndPlayReason> EndPlayReason);
	void ReceiveBeginPlay();
	void OnRep_IsActive();
	void K2_DestroyComponent(class UObject* Object);
	bool IsComponentTickEnabled();
	bool IsBeingDestroyed();
	bool IsActive();
	class AActor* GetOwner();
	void Deactivate();
	bool ComponentHasTag(const struct FName& Tag);
	void AddTickPrerequisiteComponent(class UActorComponent* PrerequisiteComponent);
	void AddTickPrerequisiteActor(class AActor* PrerequisiteActor);
	void Activate(bool bReset);
};


// Class Engine.SceneComponent
// 0x0210 (0x02E0 - 0x00D0)
class USceneComponent : public UActorComponent
{
public:
	class USceneComponent*                             AttachParent;                                             // 0x00D0(0x0008) (CPF_ExportObject, CPF_Net, CPF_ZeroConstructor, CPF_InstancedReference, CPF_IsPlainOldData)
	TArray<class USceneComponent*>                     AttachChildren;                                           // 0x00D8(0x0010) (CPF_ExportObject, CPF_ZeroConstructor, CPF_Transient)
	struct FName                                       AttachSocketName;                                         // 0x00E8(0x0008) (CPF_Net, CPF_ZeroConstructor, CPF_IsPlainOldData)
	unsigned char                                      bRequiresCustomLocation : 1;                              // 0x00F0(0x0001) ( BITFIELD: 0101)
	unsigned char                                      bAbsoluteLocation : 1;                                    // 0x00F0(0x0001) (CPF_Edit, CPF_BlueprintVisible, CPF_Net BITFIELD: 0202)
	unsigned char                                      bAbsoluteTranslation : 1;                                 // 0x00F0(0x0001) (CPF_Deprecated BITFIELD: 0404)
	unsigned char                                      bAbsoluteRotation : 1;                                    // 0x00F0(0x0001) (CPF_Edit, CPF_BlueprintVisible, CPF_Net BITFIELD: 0808)
	unsigned char                                      bAbsoluteScale : 1;                                       // 0x00F0(0x0001) (CPF_Edit, CPF_BlueprintVisible, CPF_Net BITFIELD: 1010)
	unsigned char                                      bVisible : 1;                                             // 0x00F0(0x0001) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_Net BITFIELD: 2020)
	unsigned char                                      bHiddenInGame : 1;                                        // 0x00F0(0x0001) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_DisableEditOnInstance BITFIELD: 4040)
	unsigned char                                      bShouldUpdatePhysicsVolume : 1;                           // 0x00F0(0x0001) (CPF_Edit, CPF_BlueprintVisible BITFIELD: 8080)
	unsigned char                                      bBoundsChangeTriggersStreamingDataRebuild : 1;            // 0x00F1(0x0001) ( BITFIELD: 0101)
	unsigned char                                      bUseAttachParentBound : 1;                                // 0x00F1(0x0001) (CPF_Edit, CPF_BlueprintVisible BITFIELD: 0202)
	unsigned char                                      bComponentIsUnionOfChildren : 1;                          // 0x00F1(0x0001) (CPF_Edit, CPF_BlueprintVisible BITFIELD: 0404)
	unsigned char                                      bUnknown00F1_0808 : 1;                                    // 0x00F1(0x0001) (CPF_TransientMANUAL_ADD_BIT 0808)
	unsigned char                                      bWorldToComponentUpdated : 1;                             // 0x00F1(0x0001) (CPF_Transient BITFIELD: 1010)
	TWeakObjectPtr<class APhysicsVolume>               PhysicsVolume;                                            // 0x00F4(0x0008) (CPF_ZeroConstructor, CPF_Transient, CPF_IsPlainOldData)
	unsigned char                                      UnknownData00[0xF4];                                      // 0x00FC(0x00F4) MISSED OFFSET
	struct FVector                                     RelativeLocation;                                         // 0x01F0(0x000C) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_Net, CPF_ZeroConstructor, CPF_IsPlainOldData)
	struct FRotator                                    RelativeRotation;                                         // 0x01FC(0x000C) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_Net, CPF_ZeroConstructor, CPF_IsPlainOldData)
	unsigned char                                      UnknownData01[0x28];                                      // 0x0208(0x0028) MISSED OFFSET
	struct FVector                                     RelativeScale3D;                                          // 0x0230(0x000C) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_Net, CPF_ZeroConstructor, CPF_IsPlainOldData)
	struct FVector                                     RelativeTranslation;                                      // 0x023C(0x000C) (CPF_ZeroConstructor, CPF_Deprecated, CPF_IsPlainOldData)
	TEnumAsByte<EComponentMobility>                    Mobility;                                                 // 0x0248(0x0001) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_IsPlainOldData)
	TEnumAsByte<EDetailMode>                           DetailMode;                                               // 0x0249(0x0001) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_IsPlainOldData)
	unsigned char                                      UnknownData02[0x16];                                      // 0x024A(0x0016) MISSED OFFSET
	struct FVector                                     ComponentVelocity;                                        // 0x0260(0x000C) (CPF_ZeroConstructor, CPF_IsPlainOldData)
	unsigned char                                      UnknownData03[0x4];                                       // 0x026C(0x0004) MISSED OFFSET
	struct FScriptMulticastDelegate                    PhysicsVolumeChangedDelegate;                             // 0x0270(0x0010) (CPF_ZeroConstructor, CPF_InstancedReference, CPF_BlueprintAssignable)
	unsigned char                                      UnknownData04[0x10];                                      // 0x0280(0x0010) MISSED OFFSET
	unsigned char                                      CacheRootVelocity;                                        // 0x0290(0x0001) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData)
	unsigned char                                      UnknownData05[0x7];                                       // 0x0291(0x0007) MISSED OFFSET
	TArray<struct FName>                               SocketVelocitiesToCache;                                  // 0x0298(0x0010) (CPF_Edit, CPF_ZeroConstructor)
	unsigned char                                      UnknownData06[0x38];                                      // 0x02A8(0x0038) MISSED OFFSET

	static UClass* StaticClass()
	{
		static UClass* ptr = 0;
		if(ptr == 0) { ptr = UObject::FindClass(_xor_("Class Engine.SceneComponent")); }
		return ptr;
	}


	void ToggleVisibility(bool bPropagateToChildren);
	void SnapTo(class USceneComponent* InParent, const struct FName& InSocketName);
	bool SharesBasis(class USceneComponent* Other);
	void SetWorldScale3D(const struct FVector& NewScale);
	void SetVisibility(bool bNewVisibility, bool bPropagateToChildren);
	void SetRelativeScale3D(const struct FVector& NewScale3D);
	void SetHiddenInGame(bool NewHidden, bool bPropagateToChildren);
	void SetAbsolute(bool bNewAbsoluteLocation, bool bNewAbsoluteRotation, bool bNewAbsoluteScale);
	void ResetRelativeTransform();
	void OnRep_Visibility(bool OldValue);
	void OnRep_Transform();
	bool K2_TryGetCachedSocketVelocity(const struct FName& SocketName, struct FVector* OutVelocity);
	void K2_SetWorldTransform(const struct FTransform& NewTransform, bool bSweep, bool bTeleport, struct FHitResult* SweepHitResult);
	void K2_SetWorldRotation(const struct FRotator& NewRotation, bool bSweep, bool bTeleport, struct FHitResult* SweepHitResult);
	void K2_SetWorldLocationAndRotation(const struct FVector& NewLocation, const struct FRotator& NewRotation, bool bSweep, bool bTeleport, struct FHitResult* SweepHitResult);
	void K2_SetWorldLocation(const struct FVector& NewLocation, bool bSweep, bool bTeleport, struct FHitResult* SweepHitResult);
	void K2_SetRelativeTransform(const struct FTransform& NewTransform, bool bSweep, bool bTeleport, struct FHitResult* SweepHitResult);
	void K2_SetRelativeRotation(const struct FRotator& NewRotation, bool bSweep, bool bTeleport, struct FHitResult* SweepHitResult);
	void K2_SetRelativeLocationAndRotation(const struct FVector& NewLocation, const struct FRotator& NewRotation, bool bSweep, bool bTeleport, struct FHitResult* SweepHitResult);
	void K2_SetRelativeLocation(const struct FVector& NewLocation, bool bSweep, bool bTeleport, struct FHitResult* SweepHitResult);
	struct FTransform K2_GetComponentToWorld();
	struct FVector K2_GetComponentScale();
	struct FRotator K2_GetComponentRotation();
	struct FVector K2_GetComponentLocation();
	void K2_AttachTo(class USceneComponent* InParent, const struct FName& InSocketName, TEnumAsByte<EAttachLocation> AttachType, bool bWeldSimulatedBodies);
	void K2_AddWorldTransform(const struct FTransform& DeltaTransform, bool bSweep, bool bTeleport, struct FHitResult* SweepHitResult);
	void K2_AddWorldRotation(const struct FRotator& DeltaRotation, bool bSweep, bool bTeleport, struct FHitResult* SweepHitResult);
	void K2_AddWorldOffset(const struct FVector& DeltaLocation, bool bSweep, bool bTeleport, struct FHitResult* SweepHitResult);
	void K2_AddRelativeRotation(const struct FRotator& DeltaRotation, bool bSweep, bool bTeleport, struct FHitResult* SweepHitResult);
	void K2_AddRelativeLocation(const struct FVector& DeltaLocation, bool bSweep, bool bTeleport, struct FHitResult* SweepHitResult);
	void K2_AddLocalTransform(const struct FTransform& DeltaTransform, bool bSweep, bool bTeleport, struct FHitResult* SweepHitResult);
	void K2_AddLocalRotation(const struct FRotator& DeltaRotation, bool bSweep, bool bTeleport, struct FHitResult* SweepHitResult);
	void K2_AddLocalOffset(const struct FVector& DeltaLocation, bool bSweep, bool bTeleport, struct FHitResult* SweepHitResult);
	bool IsVisible();
	bool IsSimulatingPhysics(const struct FName& BoneName);
	bool IsAnySimulatingPhysics();
	struct FVector GetUpVector();
	struct FTransform GetSocketTransform(const struct FName& InSocketName, TEnumAsByte<ERelativeTransformSpace> TransformSpace);
	struct FRotator GetSocketRotation(const struct FName& InSocketName);
	struct FQuat GetSocketQuaternion(const struct FName& InSocketName);
	struct FVector GetSocketLocation(const struct FName& InSocketName);
	struct FVector GetRightVector();
	struct FTransform GetRelativeTransform();
	class APhysicsVolume* GetPhysicsVolume();
	void GetParentComponents(TArray<class USceneComponent*>* Parents);
	int GetNumChildrenComponents();
	struct FVector GetForwardVector();
	struct FVector GetComponentVelocity();
	void GetChildrenComponents(bool bIncludeAllDescendants, TArray<class USceneComponent*>* Children);
	class USceneComponent* GetChildComponent(int ChildIndex);
	class USceneComponent* GetAttachParent();
	struct FTransform GetAttachedBasisTransform();
	TArray<struct FName> GetAllSocketNames();
	bool DoesSocketExist(const struct FName& InSocketName);
	void DetachFromParent(bool bMaintainWorldPosition, bool bCallModify);
};


// Class Engine.AnimNotify
// 0x0008 (0x0030 - 0x0028)
class UAnimNotify : public UObject
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0028(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static UClass* ptr = 0;
		if(ptr == 0) { ptr = UObject::FindClass(_xor_("Class Engine.AnimNotify")); }
		return ptr;
	}


	bool Received_Notify(class USkeletalMeshComponent* MeshComp, class UAnimSequenceBase* Animation);
	struct FString GetNotifyName();
};


// Class Engine.AnimInstance
// 0x0418 (0x0440 - 0x0028)
class UAnimInstance : public UObject
{
public:
	float                                              DeltaTime;                                                // 0x0028(0x0004) (CPF_ZeroConstructor, CPF_Deprecated, CPF_IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x002C(0x0004) MISSED OFFSET
	class USkeleton*                                   CurrentSkeleton;                                          // 0x0030(0x0008) (CPF_ZeroConstructor, CPF_Transient, CPF_IsPlainOldData)
	TArray<struct FAnimTickRecord>                     UngroupedActivePlayers;                                   // 0x0038(0x0010) (CPF_ZeroConstructor, CPF_Transient)
	TArray<struct FAnimGroupInstance>                  SyncGroups;                                               // 0x0048(0x0010) (CPF_ZeroConstructor, CPF_Transient)
	TArray<struct FActiveVertexAnim>                   VertexAnims;                                              // 0x0058(0x0010) (CPF_ZeroConstructor, CPF_Transient)
	TEnumAsByte<ERootMotionMode>                       RootMotionMode;                                           // 0x0068(0x0001) (CPF_Edit, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_IsPlainOldData)
	unsigned char                                      bWarnAboutBlueprintUsage;                                 // 0x0069(0x0001) (CPF_Edit, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_IsPlainOldData)
	unsigned char                                      UnknownData01[0x6];                                       // 0x006A(0x0006) MISSED OFFSET
	struct FScriptMulticastDelegate                    OnMontageBlendingOut;                                     // 0x0070(0x0010) (CPF_ZeroConstructor, CPF_InstancedReference, CPF_BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnMontageStarted;                                         // 0x0080(0x0010) (CPF_ZeroConstructor, CPF_InstancedReference, CPF_BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnMontageEnded;                                           // 0x0090(0x0010) (CPF_ZeroConstructor, CPF_InstancedReference, CPF_BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnStateEntered;                                           // 0x00A0(0x0010) (CPF_ZeroConstructor, CPF_InstancedReference, CPF_BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnStateExited;                                            // 0x00B0(0x0010) (CPF_ZeroConstructor, CPF_InstancedReference, CPF_BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnStateInitialised;                                       // 0x00C0(0x0010) (CPF_ZeroConstructor, CPF_InstancedReference, CPF_BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnAnimUpdated;                                            // 0x00D0(0x0010) (CPF_ZeroConstructor, CPF_InstancedReference)
	unsigned char                                      UnknownData02[0x70];                                      // 0x00E0(0x0070) MISSED OFFSET
	unsigned char                                      bQueueMontageEvents;                                      // 0x0150(0x0001) (CPF_ZeroConstructor, CPF_Transient, CPF_IsPlainOldData)
	unsigned char                                      UnknownData03[0xF7];                                      // 0x0151(0x00F7) MISSED OFFSET
	TArray<struct FAnimNotifyEvent>                    ActiveAnimNotifyState;                                    // 0x0248(0x0010) (CPF_ZeroConstructor, CPF_Transient)
	unsigned char                                      UnknownData04[0x100];                                     // 0x0258(0x0100) MISSED OFFSET
	int16_t                                            SlotNodeInitializationCounter;                            // 0x0358(0x0002) (CPF_ZeroConstructor, CPF_Transient, CPF_IsPlainOldData)
	int16_t                                            GraphTraversalCounter;                                    // 0x035A(0x0002) (CPF_ZeroConstructor, CPF_Transient, CPF_IsPlainOldData)
	unsigned char                                      UnknownData05[0x54];                                      // 0x035C(0x0054) MISSED OFFSET
	unsigned char                                      bBoneCachesInvalidated;                                   // 0x03B0(0x0001) (CPF_ZeroConstructor, CPF_Transient, CPF_IsPlainOldData)
	unsigned char                                      UnknownData06[0x8F];                                      // 0x03B1(0x008F) MISSED OFFSET

	static UClass* StaticClass()
	{
		static UClass* ptr = 0;
		if(ptr == 0) { ptr = UObject::FindClass(_xor_("Class Engine.AnimInstance")); }
		return ptr;
	}


	void UnlockAIResources(bool bUnlockMovement, bool UnlockAILogic);
	class APawn* TryGetPawnOwner();
	void StopSlotAnimation(float InBlendOutTime, const struct FName& SlotNodeName);
	void SetMorphTarget(const struct FName& MorphTargetName, float Value);
	class UAnimMontage* PlaySlotAnimationAsDynamicMontage(class UAnimSequenceBase* Asset, const struct FName& SlotNodeName, float BlendInTime, float BlendOutTime, float InPlayRate, int LoopCount, float BlendOutTriggerTime);
	float PlaySlotAnimation(class UAnimSequenceBase* Asset, const struct FName& SlotNodeName, float BlendInTime, float BlendOutTime, float InPlayRate, int LoopCount);
	void Montage_Stop(float InBlendOutTime, class UAnimMontage* Montage);
	void Montage_SetPlayRate(class UAnimMontage* Montage, float NewPlayRate);
	void Montage_SetNextSection(const struct FName& SectionNameToChange, const struct FName& NextSection, class UAnimMontage* Montage);
	float Montage_Play(class UAnimMontage* MontageToPlay, float InPlayRate);
	void Montage_Pause(class UAnimMontage* Montage);
	void Montage_JumpToSectionsEnd(const struct FName& SectionName, class UAnimMontage* Montage);
	void Montage_JumpToSection(const struct FName& SectionName, class UAnimMontage* Montage);
	bool Montage_IsPlaying(class UAnimMontage* Montage);
	bool Montage_IsActive(class UAnimMontage* Montage);
	struct FName Montage_GetCurrentSection(class UAnimMontage* Montage);
	void LockAIResources(bool bLockMovement, bool LockAILogic);
	bool IsPlayingSlotAnimation(class UAnimSequenceBase* Asset, const struct FName& SlotNodeName);
	float GetSyncGroupPosition(const struct FName& Name);
	float GetStateWeight(int MachineIndex, int StateIndex);
	float GetRelevantAnimTimeRemainingFraction(int MachineIndex, int StateIndex);
	float GetRelevantAnimTimeRemaining(int MachineIndex, int StateIndex);
	float GetRelevantAnimTimeFraction(int MachineIndex, int StateIndex);
	float GetRelevantAnimTime(int MachineIndex, int StateIndex);
	float GetRelevantAnimLength(int MachineIndex, int StateIndex);
	class USkeletalMeshComponent* GetOwningComponent();
	class AActor* GetOwningActor();
	float GetMaxPlayingAnimTimeRemaining(int MachineIndex, int StateIndex);
	float GetMaxAnimTimeRemaining(int MachineIndex, int StateIndex);
	float GetInstanceTransitionTimeElapsedFraction(int MachineIndex, int TransitionIndex);
	float GetInstanceTransitionTimeElapsed(int MachineIndex, int TransitionIndex);
	float GetInstanceTransitionCrossfadeDuration(int MachineIndex, int TransitionIndex);
	float GetInstanceStateWeight(int MachineIndex, int StateIndex);
	float GetInstanceCurrentStateElapsedTime(int MachineIndex);
	float GetInstanceAssetPlayerTimeFromEndFraction(int AssetPlayerIndex);
	float GetInstanceAssetPlayerTimeFromEnd(int AssetPlayerIndex);
	float GetInstanceAssetPlayerTimeFraction(int AssetPlayerIndex);
	float GetInstanceAssetPlayerTime(int AssetPlayerIndex);
	float GetInstanceAssetPlayerLength(int AssetPlayerIndex);
	float GetCurveValue(const struct FName& CurveName);
	struct FName GetCurrentStateName(int MachineIndex);
	float GetCurrentStateElapsedTime(int MachineIndex);
	float GetAnimAssetPlayerTimeFromEndFraction(class UAnimationAsset* AnimAsset, float CurrentTime);
	float GetAnimAssetPlayerTimeFromEnd(class UAnimationAsset* AnimAsset, float CurrentTime);
	float GetAnimAssetPlayerTimeFraction(class UAnimationAsset* AnimAsset, float CurrentTime);
	float GetAnimAssetPlayerLength(class UAnimationAsset* AnimAsset);
	void ClearMorphTargets();
	float CalculateDirection(const struct FVector& Velocity, const struct FRotator& BaseRotation);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void BlueprintUninitializeAnimation();
	void BlueprintPostEvaluateAnimation();
	void BlueprintInitializeAnimation();
	void AnimNotify_Sound(class UAnimNotify* Notify);
};


// Class Engine.CameraComponent
// 0x0560 (0x0840 - 0x02E0)
class UCameraComponent : public USceneComponent
{
public:
	float                                              FieldOfView;                                              // 0x02E0(0x0004) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	float                                              OrthoWidth;                                               // 0x02E4(0x0004) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	float                                              OrthoNearClipPlane;                                       // 0x02E8(0x0004) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	float                                              OrthoFarClipPlane;                                        // 0x02EC(0x0004) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	float                                              AspectRatio;                                              // 0x02F0(0x0004) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	unsigned char                                      bConstrainAspectRatio : 1;                                // 0x02F4(0x0001) (CPF_Edit, CPF_BlueprintVisible BITFIELD: 0101)
	unsigned char                                      bUseFieldOfViewForLOD : 1;                                // 0x02F4(0x0001) (CPF_Edit, CPF_BlueprintVisible BITFIELD: 0202)
	unsigned char                                      bUsePawnControlRotation : 1;                              // 0x02F4(0x0001) (CPF_Edit, CPF_BlueprintVisible BITFIELD: 0404)
	TEnumAsByte<ECameraProjectionMode>                 ProjectionMode;                                           // 0x02F8(0x0001) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	float                                              PostProcessBlendWeight;                                   // 0x02FC(0x0004) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	struct FPostProcessSettings                        PostProcessSettings;                                      // 0x0300(0x0530) (CPF_Edit, CPF_BlueprintVisible)
	unsigned char                                      bUseControllerViewRotation : 1;                           // 0x0830(0x0001) (CPF_Deprecated BITFIELD: 0101)
	unsigned char                                      UnknownData00[0xF];                                       // 0x0831(0x000F) MISSED OFFSET

	static UClass* StaticClass()
	{
		static UClass* ptr = 0;
		if(ptr == 0) { ptr = UObject::FindClass(_xor_("Class Engine.CameraComponent")); }
		return ptr;
	}


	struct FVector ProjectWorldLocation(const struct FVector& WorldLocation, const struct FIntPoint& ViewDimensions);
	void GetCameraView(float DeltaTime, struct FMinimalViewInfo* DesiredView);
	void AddOrUpdateBlendable(const TScriptInterface<class UBlendableInterface>& InBlendableObject, float InWeight);
};


// Class Engine.Pawn
// 0x0060 (0x04C8 - 0x0468)
class APawn : public AActor
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0468(0x0008) MISSED OFFSET
	unsigned char                                      bUnknown0468_0101 : 1;                                    // 0x0468(0x0001) (CPF_Edit, CPF_BlueprintVisibleMANUAL_ADD_BIT 0101)
	unsigned char                                      bUnknown0468_0202 : 1;                                    // 0x0468(0x0001) (MANUAL_ADD_BIT 0202)
	unsigned char                                      bUnknown0468_0404 : 1;                                    // 0x0468(0x0001) (MANUAL_ADD_BIT 0404)
	unsigned char                                      bUnknown0468_0808 : 1;                                    // 0x0468(0x0001) (MANUAL_ADD_BIT 0808)
	unsigned char                                      bUnknown0468_1010 : 1;                                    // 0x0468(0x0001) (MANUAL_ADD_BIT 1010)
	unsigned char                                      bUnknown0468_2020 : 1;                                    // 0x0468(0x0001) (MANUAL_ADD_BIT 2020)
	unsigned char                                      bUnknown0468_4040 : 1;                                    // 0x0468(0x0001) (MANUAL_ADD_BIT 4040)
	unsigned char                                      bUnknown0468_8080 : 1;                                    // 0x0468(0x0001) (MANUAL_ADD_BIT 8080)
	unsigned char                                      bUseControllerRotationPitch : 1;                          // 0x0470(0x0001) (CPF_Edit, CPF_BlueprintVisible BITFIELD: 0101)
	unsigned char                                      bUseControllerRotationYaw : 1;                            // 0x0470(0x0001) (CPF_Edit, CPF_BlueprintVisible BITFIELD: 0202)
	unsigned char                                      bUseControllerRotationRoll : 1;                           // 0x0470(0x0001) (CPF_Edit, CPF_BlueprintVisible BITFIELD: 0404)
	unsigned char                                      bCanAffectNavigationGeneration : 1;                       // 0x0470(0x0001) (CPF_Edit, CPF_BlueprintVisible, CPF_BlueprintReadOnly BITFIELD: 0808)
	float                                              BaseEyeHeight;                                            // 0x0474(0x0004) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	TEnumAsByte<EAutoReceiveInput>                     AutoPossessPlayer;                                        // 0x0478(0x0001) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData)
	TEnumAsByte<EAutoPossessAI>                        AutoPossessAI;                                            // 0x0479(0x0001) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData)
	unsigned char                                      UnknownData01[0x6];                                       // 0x047A(0x0006) MISSED OFFSET
	class UClass*                                      AIControllerClass;                                        // 0x0480(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	class APlayerState*                                PlayerState;                                              // 0x0488(0x0008) (CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_Net, CPF_ZeroConstructor, CPF_IsPlainOldData)
	unsigned char                                      RemoteViewPitch;                                          // 0x0490(0x0001) (CPF_Net, CPF_ZeroConstructor, CPF_IsPlainOldData)
	unsigned char                                      UnknownData02[0x7];                                       // 0x0491(0x0007) MISSED OFFSET
	class AController*                                 LastHitBy;                                                // 0x0498(0x0008) (CPF_ZeroConstructor, CPF_Transient, CPF_IsPlainOldData)
	class AController*                                 Controller;                                               // 0x04A0(0x0008) (CPF_Net, CPF_ZeroConstructor, CPF_IsPlainOldData)
