#pragma once

// SOT: Sea of Thieves (1.0) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x4)
#endif

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// ScriptStruct Athena.ControlObjectActionRuleParams
// 0x0010
struct FControlObjectActionRuleParams
{
	TArray<TEnumAsByte<EWieldableItemSize>>            WieldableItemSizesToDisableControl;                       // 0x0000(0x0010) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor)
};

// ScriptStruct Athena.IntentPredictorParams
// 0x0014
struct FIntentPredictorParams
{
	float                                              MaxError;                                                 // 0x0000(0x0004) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	float                                              MinError;                                                 // 0x0004(0x0004) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	float                                              MinCorrectionVelocity;                                    // 0x0008(0x0004) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	float                                              MinValue;                                                 // 0x000C(0x0004) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	float                                              MaxValue;                                                 // 0x0010(0x0004) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
};

// ScriptStruct Athena.IntentPredictor
// 0x0018
struct FIntentPredictor
{
	unsigned char                                      UnknownData00[0x4];                                       // 0x0000(0x0004) MISSED OFFSET
	struct FIntentPredictorParams                      Params;                                                   // 0x0004(0x0014) (CPF_Edit)
};

// ScriptStruct Athena.PlayerStat
// 0x0010
struct FPlayerStat
{
	struct FName                                       Name;                                                     // 0x0000(0x0008) (CPF_ZeroConstructor, CPF_IsPlainOldData)
	unsigned char                                      UnknownData00[0x8];                                       // 0x0008(0x0008) MISSED OFFSET
};

// ScriptStruct Athena.AchievementCriteria
// 0x0020
struct FAchievementCriteria
{
	struct FPlayerStat                                 PlayerStat;                                               // 0x0000(0x0010) (CPF_Edit)
	uint64_t                                           Threshold;                                                // 0x0010(0x0008) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData)
	TEnumAsByte<EPlayerStatsOperator>                  Operator;                                                 // 0x0018(0x0001) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0019(0x0007) MISSED OFFSET
};

// ScriptStruct Athena.AchievementDefinition
// 0x0020
struct FAchievementDefinition
{
	struct FName                                       DevCenterId;                                              // 0x0000(0x0008) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData)
	struct FName                                       FriendlyName;                                             // 0x0008(0x0008) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData)
	TArray<struct FAchievementCriteria>                UnlockCriteria;                                           // 0x0010(0x0010) (CPF_Edit, CPF_ZeroConstructor)
};

// ScriptStruct Athena.SkeletonAICharacterAudioStrategyAudioEvents
// 0x0028
struct FSkeletonAICharacterAudioStrategyAudioEvents
{
	class UClass*                                      AIStrategy;                                               // 0x0000(0x0008) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData)
	class UWwiseEvent*                                 PlayStrategyLoop;                                         // 0x0008(0x0008) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData)
	class UWwiseEvent*                                 StopStrategyLoop;                                         // 0x0010(0x0008) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData)
	class UWwiseEvent*                                 StartStrategyOneShot;                                     // 0x0018(0x0008) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData)
	class UWwiseEvent*                                 LeaveStrategyOneShot;                                     // 0x0020(0x0008) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData)
};

// ScriptStruct Athena.ReplicatedAIPartsData
// 0x0010
struct FReplicatedAIPartsData
{
	class UAIPartsCategory*                            PartsCategory;                                            // 0x0000(0x0008) (CPF_ZeroConstructor, CPF_IsPlainOldData)
	int                                                MeshIndex;                                                // 0x0008(0x0004) (CPF_ZeroConstructor, CPF_IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x000C(0x0004) MISSED OFFSET
};

// ScriptStruct Athena.AnimNotifyWwiseObserver
// 0x0018
struct FAnimNotifyWwiseObserver
{
	class UWwiseEvent*                                 OnEventPosted;                                            // 0x0000(0x0008) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData)
	TArray<class UWwiseEvent*>                         AdditionalEventsToTrigger;                                // 0x0008(0x0010) (CPF_Edit, CPF_ZeroConstructor)
};

// ScriptStruct Athena.AthenaAIEngageEnemyData
// 0x0010
struct FAthenaAIEngageEnemyData
{
	class UClass*                                      EngageEnemyMethod;                                        // 0x0000(0x0008) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData)
	float                                              BestTargetRange;                                          // 0x0008(0x0004) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x000C(0x0004) MISSED OFFSET
};

// ScriptStruct Athena.AthenaAIItemEngageEnemyMethods
// 0x0018
struct FAthenaAIItemEngageEnemyMethods
{
	class UClass*                                      ItemCategory;                                             // 0x0000(0x0008) (CPF_Edit, CPF_ZeroConstructor, CPF_IsPlainOldData)
	TArray<struct FAthenaAIEngageEnemyData>            EngageEnemyDataList;                                      // 0x0008(0x0010) (CPF_Edit, CPF_ZeroConstructor)
};

// ScriptStruct Athena.AthenaAnimationObjectLocomotionAnimations
// 0x0038
struct FAthenaAnimationObjectLocomotionAnimations
{
	class UBlendSpace*                                 Locomotion1;                                              // 0x0000(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	class UBlendSpace*                                 Locomotion2;                                              // 0x0008(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	class UBlendSpace*                                 Locomotion3;                                              // 0x0010(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	class UBlendSpace*                                 Locomotion4;                                              // 0x0018(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	class UAnimSequence*                               LocomotionTurningLeft;                                    // 0x0020(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	class UAnimSequence*                               LocomotionTurningRight;                                   // 0x0028(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	class UBlendSpace*                                 LocomotionSwimming;                                       // 0x0030(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
};

// ScriptStruct Athena.AthenaAnimationObjectJumpingAnimations
// 0x0020
struct FAthenaAnimationObjectJumpingAnimations
{
	class UBlendSpace*                                 Start;                                                    // 0x0000(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	class UBlendSpace*                                 Cycle;                                                    // 0x0008(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	class UBlendSpace*                                 PreImpact;                                                // 0x0010(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	class UBlendSpace*                                 LandLight;                                                // 0x0018(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
};

// ScriptStruct Athena.AthenaAnimationObjectEquipAnimations
// 0x0028
struct FAthenaAnimationObjectEquipAnimations
{
	class UAnimSequence*                               Equip;                                                    // 0x0000(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	class UBlendSpace*                                 EquipSwimming;                                            // 0x0008(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	class UAnimSequence*                               UnEquip;                                                  // 0x0010(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	class UAnimSequence*                               Pickup;                                                   // 0x0018(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	class UAnimSequence*                               Drop;                                                     // 0x0020(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
};

// ScriptStruct Athena.AthenaAnimationObjectIdleAnimations
// 0x0018
struct FAthenaAnimationObjectIdleAnimations
{
	class UAnimSequence*                               Idle1;                                                    // 0x0000(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	class UAnimSequence*                               Idle2;                                                    // 0x0008(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	class UAnimSequence*                               Idle3;                                                    // 0x0010(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
};

// ScriptStruct Athena.AthenaAnimationObjectActionOneShot
// 0x0030
struct FAthenaAnimationObjectActionOneShot
{
	TArray<class UAnimSequence*>                       MainAction;                                               // 0x0000(0x0010) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor)
	class UAnimSequence*                               MainFail;                                                 // 0x0010(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	TArray<class UAnimSequence*>                       AlternateAction;                                          // 0x0018(0x0010) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor)
	class UAnimSequence*                               AlternateFail;                                            // 0x0028(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
};

// ScriptStruct Athena.AthenaAnimationObjectActionContinuousSwimming
// 0x0020
struct FAthenaAnimationObjectActionContinuousSwimming
{
	class UBlendSpace*                                 MainInSwimming;                                           // 0x0000(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	class UBlendSpace*                                 MainOneShotInSwimming;                                    // 0x0008(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	class UBlendSpace*                                 MainCycleSwimming;                                        // 0x0010(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	class UBlendSpace*                                 MainOutSwimming;                                          // 0x0018(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
};

// ScriptStruct Athena.AthenaAnimationLocomotionTurningAnimData
// 0x0008
struct FAthenaAnimationLocomotionTurningAnimData
{
	class UAnimSequence*                               Turn90;                                                   // 0x0000(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
};

// ScriptStruct Athena.AthenaAnimationObjectActionContinuousStruct
// 0x0090
struct FAthenaAnimationObjectActionContinuousStruct
{
	class UAnimSequence*                               MainInto;                                                 // 0x0000(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	class UAnimSequence*                               OneShotInto;                                              // 0x0008(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	class UAnimSequence*                               MainCycleIdle;                                            // 0x0010(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	class UBlendSpace*                                 MainCycleLocomotion;                                      // 0x0018(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	unsigned char                                      UseMainCycleJump;                                         // 0x0020(0x0001) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0021(0x0007) MISSED OFFSET
	struct FAthenaAnimationObjectJumpingAnimations     MainCycleJump;                                            // 0x0028(0x0020) (CPF_Edit, CPF_BlueprintVisible)
	class UAnimSequence*                               MainOutOf;                                                // 0x0048(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	class UAnimSequence*                               MainFail;                                                 // 0x0050(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	struct FAthenaAnimationObjectActionContinuousSwimming MainSwimming;                                             // 0x0058(0x0020) (CPF_Edit, CPF_BlueprintVisible)
	struct FAthenaAnimationLocomotionTurningAnimData   TurningLeftAlt;                                           // 0x0078(0x0008) (CPF_Edit, CPF_BlueprintVisible)
	struct FAthenaAnimationLocomotionTurningAnimData   TurningRightAlt;                                          // 0x0080(0x0008) (CPF_Edit, CPF_BlueprintVisible)
	class UAnimSequence*                               TurnOutAlt;                                               // 0x0088(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
};

// ScriptStruct Athena.AthenaAnimationObjectActionContinuous
// 0x0120
struct FAthenaAnimationObjectActionContinuous
{
	struct FAthenaAnimationObjectActionContinuousStruct MainContinuousActions;                                    // 0x0000(0x0090) (CPF_Edit, CPF_BlueprintVisible)
	struct FAthenaAnimationObjectActionContinuousStruct AlternateContinuousActions;                               // 0x0090(0x0090) (CPF_Edit, CPF_BlueprintVisible)
};

// ScriptStruct Athena.AthenaAnimationObjectActionOneShotPitchOverride
// 0x0030
struct FAthenaAnimationObjectActionOneShotPitchOverride
{
	TArray<class UBlendSpace1D*>                       MainAction;                                               // 0x0000(0x0010) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor)
	class UBlendSpace1D*                               MainFail;                                                 // 0x0010(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	TArray<class UBlendSpace1D*>                       AlternateAction;                                          // 0x0018(0x0010) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor)
	class UBlendSpace1D*                               AlternateFail;                                            // 0x0028(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
};

// ScriptStruct Athena.AthenaAnimationObjectJumpingAnimationsPitchOverride
// 0x0020
struct FAthenaAnimationObjectJumpingAnimationsPitchOverride
{
	class UBlendSpace1D*                               Start;                                                    // 0x0000(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	class UBlendSpace1D*                               Cycle;                                                    // 0x0008(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	class UBlendSpace1D*                               PreImpact;                                                // 0x0010(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	class UBlendSpace1D*                               LandLight;                                                // 0x0018(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
};

// ScriptStruct Athena.AthenaAnimationObjectActionContinuousStructPitchOverride
// 0x0080
struct FAthenaAnimationObjectActionContinuousStructPitchOverride
{
	class UBlendSpace1D*                               MainInto;                                                 // 0x0000(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	class UBlendSpace1D*                               MainCycleIdle;                                            // 0x0008(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	class UBlendSpace1D*                               MainCycleLocomotion;                                      // 0x0010(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	TArray<class UBlendSpace1D*>                       VariantCycleIdle;                                         // 0x0018(0x0010) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor)
	unsigned char                                      UseMainCycleJump;                                         // 0x0028(0x0001) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0029(0x0007) MISSED OFFSET
	struct FAthenaAnimationObjectJumpingAnimationsPitchOverride MainCycleJump;                                            // 0x0030(0x0020) (CPF_Edit, CPF_BlueprintVisible)
	class UBlendSpace1D*                               MainOutOf;                                                // 0x0050(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	class UBlendSpace1D*                               MainFail;                                                 // 0x0058(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	struct FAthenaAnimationObjectActionContinuousSwimming MainSwimming;                                             // 0x0060(0x0020) (CPF_Edit, CPF_BlueprintVisible)
};

// ScriptStruct Athena.AthenaAnimationObjectActionContinuousPitchOverride
// 0x0100
struct FAthenaAnimationObjectActionContinuousPitchOverride
{
	struct FAthenaAnimationObjectActionContinuousStructPitchOverride MainContinuousActions;                                    // 0x0000(0x0080) (CPF_Edit, CPF_BlueprintVisible)
	struct FAthenaAnimationObjectActionContinuousStructPitchOverride AlternateContinuousActions;                               // 0x0080(0x0080) (CPF_Edit, CPF_BlueprintVisible)
};

// ScriptStruct Athena.AthenaAnimationObjectComplexOneShot
// 0x0028
struct FAthenaAnimationObjectComplexOneShot
{
	class UAnimSequence*                               WarmUp;                                                   // 0x0000(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	class UAnimSequence*                               WarmUpFromBlock;                                          // 0x0008(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	class UAnimSequence*                               Action;                                                   // 0x0010(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	class UAnimSequence*                               Recover;                                                  // 0x0018(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	class UAnimSequence*                               HeavyAttackStunRecover;                                   // 0x0020(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
};

// ScriptStruct Athena.AthenaAnimationObjectMeleeV2
// 0x0128
struct FAthenaAnimationObjectMeleeV2
{
	TArray<struct FAthenaAnimationObjectComplexOneShot> ComboAttacks;                                             // 0x0000(0x0010) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor)
	TArray<struct FAthenaAnimationObjectComplexOneShot> ComboAttacksStatic;                                       // 0x0010(0x0010) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor)
	TArray<struct FAthenaAnimationObjectComplexOneShot> SwimmingComboAttacks;                                     // 0x0020(0x0010) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor)
	struct FAthenaAnimationObjectComplexOneShot        HeavyAttack;                                              // 0x0030(0x0028) (CPF_Edit, CPF_BlueprintVisible)
	struct FAthenaAnimationObjectComplexOneShot        SwimmingHeavyAttack;                                      // 0x0058(0x0028) (CPF_Edit, CPF_BlueprintVisible)
	class UAnimSequence*                               BlockingMainInto;                                         // 0x0080(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	class UAnimSequence*                               BlockingIntoFromCombat;                                   // 0x0088(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	class UBlendSpace*                                 BlockingMainBlendSpace;                                   // 0x0090(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	TArray<class UAnimSequence*>                       BlockingFeedbackSequences;                                // 0x0098(0x0010) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor)
	class UAnimSequence*                               BlockingOut;                                              // 0x00A8(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	class UAnimSequence*                               BlockingMainIntoSwimming;                                 // 0x00B0(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	class UBlendSpace*                                 BlockingMainBlendSpaceSwimming;                           // 0x00B8(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	TArray<class UAnimSequence*>                       BlockingFeedbackSequencesSwimming;                        // 0x00C0(0x0010) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor)
	class UAnimSequence*                               BlockingOutSwimming;                                      // 0x00D0(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	struct FAthenaAnimationObjectJumpingAnimations     BlockingJump;                                             // 0x00D8(0x0020) (CPF_Edit, CPF_BlueprintVisible)
	class UBlendSpace*                                 CombatLocomotion;                                         // 0x00F8(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	class UAnimSequence*                               CombatLocomotionTurningLeft;                              // 0x0100(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	class UAnimSequence*                               CombatLocomotionTurningRight;                             // 0x0108(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	class UAnimSequence*                               CombatLocomotionTurnOut;                                  // 0x0110(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	class UBlendSpace*                                 Dodge;                                                    // 0x0118(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	class UBlendSpace*                                 LungeWarmupLocomotion;                                    // 0x0120(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
};

// ScriptStruct Athena.WieldAnimationParams
// 0x0001
struct FWieldAnimationParams
{
	TEnumAsByte<EWieldAnimationLocation>               WieldLocation;                                            // 0x0000(0x0001) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
};

// ScriptStruct Athena.AthenaAnimationObjectFacial
// 0x0070
struct FAthenaAnimationObjectFacial
{
	TArray<class UAnimMontage*>                        PrimaryContinuous;                                        // 0x0000(0x0010) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor)
	TArray<class UAnimMontage*>                        SecondaryContinuous;                                      // 0x0010(0x0010) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor)
	TArray<class UAnimMontage*>                        PrimaryOneShot;                                           // 0x0020(0x0010) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor)
	TArray<class UAnimMontage*>                        SecondaryOneShot;                                         // 0x0030(0x0010) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor)
	TArray<class UAnimMontage*>                        MeleeBlocking;                                            // 0x0040(0x0010) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor)
	TArray<class UAnimMontage*>                        MeleeAttack;                                              // 0x0050(0x0010) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor)
	TArray<class UAnimMontage*>                        MeleeBlockReact;                                          // 0x0060(0x0010) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor)
};

// ScriptStruct Athena.AthenaAnimationSkeletonKnockbackLocomotion
// 0x0010
struct FAthenaAnimationSkeletonKnockbackLocomotion
{
	class UAnimSequence*                               Forwards;                                                 // 0x0000(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	class UAnimSequence*                               Backwards;                                                // 0x0008(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
};

// ScriptStruct Athena.AthenaAnimationSkeletonKnockbackLocomotionStrength
// 0x0020
struct FAthenaAnimationSkeletonKnockbackLocomotionStrength
{
	struct FAthenaAnimationSkeletonKnockbackLocomotion LowStrength;                                              // 0x0000(0x0010) (CPF_Edit, CPF_BlueprintVisible)
	struct FAthenaAnimationSkeletonKnockbackLocomotion HighStrength;                                             // 0x0010(0x0010) (CPF_Edit, CPF_BlueprintVisible)
};

// ScriptStruct Athena.AthenaAnimationCoreObjectAnimations
// 0x0860
struct FAthenaAnimationCoreObjectAnimations
{
	struct FAthenaAnimationObjectLocomotionAnimations  Locomotion;                                               // 0x0000(0x0038) (CPF_Edit, CPF_BlueprintVisible)
	struct FAthenaAnimationObjectLocomotionAnimations  AlternateLocomotion;                                      // 0x0038(0x0038) (CPF_Edit, CPF_BlueprintVisible)
	struct FAthenaAnimationObjectJumpingAnimations     Jumping;                                                  // 0x0070(0x0020) (CPF_Edit, CPF_BlueprintVisible)
	struct FAthenaAnimationObjectJumpingAnimations     AlternateJumping;                                         // 0x0090(0x0020) (CPF_Edit, CPF_BlueprintVisible)
	struct FAthenaAnimationObjectEquipAnimations       Equipping;                                                // 0x00B0(0x0028) (CPF_Edit, CPF_BlueprintVisible)
	struct FAthenaAnimationObjectIdleAnimations        Idles;                                                    // 0x00D8(0x0018) (CPF_Edit, CPF_BlueprintVisible)
	struct FAthenaAnimationObjectIdleAnimations        AlternateIdles;                                           // 0x00F0(0x0018) (CPF_Edit, CPF_BlueprintVisible)
	struct FAthenaAnimationObjectActionOneShot         ActionPrimarySingle;                                      // 0x0108(0x0030) (CPF_Edit, CPF_BlueprintVisible)
	struct FAthenaAnimationObjectActionContinuous      ActionPrimaryContinuous;                                  // 0x0138(0x0120) (CPF_Edit, CPF_BlueprintVisible)
	unsigned char                                      PrimaryActionPitchOverride;                               // 0x0258(0x0001) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0259(0x0007) MISSED OFFSET
	struct FAthenaAnimationObjectActionOneShotPitchOverride ActionPrimarySinglePitchOverride;                         // 0x0260(0x0030) (CPF_Edit, CPF_BlueprintVisible)
	struct FAthenaAnimationObjectActionContinuousPitchOverride ActionPrimaryContinuousPitchOverride;                     // 0x0290(0x0100) (CPF_Edit, CPF_BlueprintVisible)
	struct FAthenaAnimationObjectActionOneShot         ActionSecondarySingle;                                    // 0x0390(0x0030) (CPF_Edit, CPF_BlueprintVisible)
	struct FAthenaAnimationObjectActionContinuous      ActionSecondaryContinuous;                                // 0x03C0(0x0120) (CPF_Edit, CPF_BlueprintVisible)
	unsigned char                                      SecondaryActionPitchOverride;                             // 0x04E0(0x0001) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	unsigned char                                      UnknownData01[0x7];                                       // 0x04E1(0x0007) MISSED OFFSET
	struct FAthenaAnimationObjectActionOneShotPitchOverride ActionSecondarySinglePitchOverride;                       // 0x04E8(0x0030) (CPF_Edit, CPF_BlueprintVisible)
	struct FAthenaAnimationObjectActionContinuousPitchOverride ActionSecondaryContinuousPitchOverride;                   // 0x0518(0x0100) (CPF_Edit, CPF_BlueprintVisible)
	struct FAthenaAnimationObjectMeleeV2               MeleeV2;                                                  // 0x0618(0x0128) (CPF_Edit, CPF_BlueprintVisible)
	class UAnimSequence*                               HandAdditive;                                             // 0x0740(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	unsigned char                                      UnknownData02[0x8];                                       // 0x0748(0x0008) MISSED OFFSET
	struct FTransform                                  OffsetLeftHand;                                           // 0x0750(0x0030) (CPF_Edit, CPF_BlueprintVisible, CPF_IsPlainOldData)
	struct FTransform                                  OffsetRightHand;                                          // 0x0780(0x0030) (CPF_Edit, CPF_BlueprintVisible, CPF_IsPlainOldData)
	struct FWieldAnimationParams                       Params;                                                   // 0x07B0(0x0001) (CPF_Edit, CPF_BlueprintVisible)
	unsigned char                                      UnknownData03[0x7];                                       // 0x07B1(0x0007) MISSED OFFSET
	struct FAthenaAnimationObjectFacial                Facial;                                                   // 0x07B8(0x0070) (CPF_Edit, CPF_BlueprintVisible)
	unsigned char                                      RangedWeapon;                                             // 0x0828(0x0001) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	unsigned char                                      UnknownData04[0x7];                                       // 0x0829(0x0007) MISSED OFFSET
	struct FAthenaAnimationSkeletonKnockbackLocomotionStrength KnockBack;                                                // 0x0830(0x0020) (CPF_Edit, CPF_BlueprintVisible)
	class UAnimSequence*                               ScreamStun;                                               // 0x0850(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	unsigned char                                      UnknownData05[0x8];                                       // 0x0858(0x0008) MISSED OFFSET
};

// ScriptStruct Athena.AthenaAnimationObjectTargetingOptions
// 0x003C
struct FAthenaAnimationObjectTargetingOptions
{
	TEnumAsByte<EObjectPitchTargetingLimbs>            ArmSelection;                                             // 0x0000(0x0001) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	float                                              UpperClampTargetingAngle;                                 // 0x0004(0x0004) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	float                                              LowerClampTargetingAngle;                                 // 0x0008(0x0004) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	float                                              ShoulderInfluenceUpper;                                   // 0x000C(0x0004) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	float                                              ShoulderInfluenceLower;                                   // 0x0010(0x0004) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	struct FVector                                     VirtualPivotOffsetUpper;                                  // 0x0014(0x000C) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	struct FVector                                     VirtualPivotOffsetLower;                                  // 0x0020(0x000C) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	unsigned char                                      LockHandOrientation;                                      // 0x002C(0x0001) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	struct FVector                                     VirtualPivotOffsetLerped;                                 // 0x0030(0x000C) (CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_IsPlainOldData)
};

// ScriptStruct Athena.AthenaAnimationPitchControlStates
// 0x0168
struct FAthenaAnimationPitchControlStates
{
	struct FAthenaAnimationObjectTargetingOptions      StandardPassive;                                          // 0x0000(0x003C) (CPF_Edit, CPF_BlueprintVisible)
	struct FAthenaAnimationObjectTargetingOptions      StandardWater;                                            // 0x003C(0x003C) (CPF_Edit, CPF_BlueprintVisible)
	struct FAthenaAnimationObjectTargetingOptions      Action1;                                                  // 0x0078(0x003C) (CPF_Edit, CPF_BlueprintVisible)
	struct FAthenaAnimationObjectTargetingOptions      Action1Water;                                             // 0x00B4(0x003C) (CPF_Edit, CPF_BlueprintVisible)
	struct FAthenaAnimationObjectTargetingOptions      Action2;                                                  // 0x00F0(0x003C) (CPF_Edit, CPF_BlueprintVisible)
	struct FAthenaAnimationObjectTargetingOptions      Action2Water;                                             // 0x012C(0x003C) (CPF_Edit, CPF_BlueprintVisible)
};

// ScriptStruct Athena.AthenaAnimationFirstPersonTurnDelay
// 0x000C
struct FAthenaAnimationFirstPersonTurnDelay
{
	float                                              MaxAngle;                                                 // 0x0000(0x0004) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	float                                              DelayOutSpeed;                                            // 0x0004(0x0004) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	float                                              DelayInSpeed;                                             // 0x0008(0x0004) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
};

// ScriptStruct Athena.AthenaAnimationFirstPersonTurnDelayStates
// 0x0020
struct FAthenaAnimationFirstPersonTurnDelayStates
{
	struct FAthenaAnimationFirstPersonTurnDelay        PassiveState;                                             // 0x0000(0x000C) (CPF_Edit, CPF_BlueprintVisible)
	struct FAthenaAnimationFirstPersonTurnDelay        ContinuousUse;                                            // 0x000C(0x000C) (CPF_Edit, CPF_BlueprintVisible)
	float                                              TurnDelayAngle;                                           // 0x0018(0x0004) (CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_IsPlainOldData)
	float                                              InvTurnDelayAngle;                                        // 0x001C(0x0004) (CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_IsPlainOldData)
};

// ScriptStruct Athena.AthenaAnimationLoadObjectsWrapper
// 0x09F0
struct FAthenaAnimationLoadObjectsWrapper
{
	struct FAthenaAnimationCoreObjectAnimations        ObjectAnimation;                                          // 0x0000(0x0860) (CPF_Edit, CPF_BlueprintVisible)
	struct FAthenaAnimationPitchControlStates          ObjectTargeting3rdPerson;                                 // 0x0860(0x0168) (CPF_Edit, CPF_BlueprintVisible)
	struct FAthenaAnimationFirstPersonTurnDelayStates  FirstPersonTurnDelay;                                     // 0x09C8(0x0020) (CPF_Edit, CPF_BlueprintVisible)
	class UClass*                                      ObjectID;                                                 // 0x09E8(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
};

// ScriptStruct Athena.AthenaAnimationHandHeldItemParams
// 0x0020
struct FAthenaAnimationHandHeldItemParams
{
	unsigned char                                      LeftArmOverlayActive;                                     // 0x0000(0x0001) (CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	unsigned char                                      RightArmOverlayActive;                                    // 0x0001(0x0001) (CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	unsigned char                                      UpperBodyOverlayActive;                                   // 0x0002(0x0001) (CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	unsigned char                                      FullBodyOverlayActive;                                    // 0x0003(0x0001) (CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	unsigned char                                      SpineOverlayActive;                                       // 0x0004(0x0001) (CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	unsigned char                                      SpineLockActive;                                          // 0x0005(0x0001) (CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	unsigned char                                      ObjectActive;                                             // 0x0006(0x0001) (CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	unsigned char                                      ObjectOverrideStateActive;                                // 0x0007(0x0001) (CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	struct FString                                     OverlayAnimationName;                                     // 0x0008(0x0010) (CPF_BlueprintVisible, CPF_ZeroConstructor)
	TEnumAsByte<EItemPassiveState>                     ObjectPassiveState;                                       // 0x0018(0x0001) (CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	unsigned char                                      QuickStow;                                                // 0x0019(0x0001) (CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	unsigned char                                      Reload;                                                   // 0x001A(0x0001) (CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	unsigned char                                      UnknownData00[0x5];                                       // 0x001B(0x0005) MISSED OFFSET
};

// ScriptStruct Athena.AthenaAnimationIdleVariantChange
// 0x0010
struct FAthenaAnimationIdleVariantChange
{
	float                                              CurrentTime;                                              // 0x0000(0x0004) (CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	float                                              TriggerTime;                                              // 0x0004(0x0004) (CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	int                                                VariantID;                                                // 0x0008(0x0004) (CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	unsigned char                                      VariantCompleted;                                         // 0x000C(0x0001) (CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
};

// ScriptStruct Athena.HandOnWheelAnimationRanges
// 0x0040
struct FHandOnWheelAnimationRanges
{
	struct FFloatRange                                 LeftHandOnWheelA;                                         // 0x0000(0x0010) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	struct FFloatRange                                 LeftHandOnWheelB;                                         // 0x0010(0x0010) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	struct FFloatRange                                 RightHandOnWheelA;                                        // 0x0020(0x0010) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	struct FFloatRange                                 RightHandOnWheelB;                                        // 0x0030(0x0010) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
};

// ScriptStruct Athena.WheelIKActivationRanges
// 0x0040
struct FWheelIKActivationRanges
{
	struct FFloatRange                                 LeftArmDownRangeA;                                        // 0x0000(0x0010) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	struct FFloatRange                                 LeftArmDownRangeB;                                        // 0x0010(0x0010) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	struct FFloatRange                                 RightArmDownRangeA;                                       // 0x0020(0x0010) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	struct FFloatRange                                 RightArmDownRangeB;                                       // 0x0030(0x0010) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
};

// ScriptStruct Athena.AthenaAnimationWheel
// 0x01B0
struct FAthenaAnimationWheel
{
	struct FSocketId                                   LeftHandMaleSocket;                                       // 0x0000(0x0020) (CPF_Edit, CPF_DisableEditOnInstance)
	struct FSocketId                                   RightHandMaleSocket;                                      // 0x0020(0x0020) (CPF_Edit, CPF_DisableEditOnInstance)
	struct FSocketId                                   LeftHandFemaleSocket;                                     // 0x0040(0x0020) (CPF_Edit, CPF_DisableEditOnInstance)
	struct FSocketId                                   RightHandFemaleSocket;                                    // 0x0060(0x0020) (CPF_Edit, CPF_DisableEditOnInstance)
	float                                              TranslationStrength;                                      // 0x0080(0x0004) (CPF_Edit, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_IsPlainOldData)
	float                                              RotationStrength;                                         // 0x0084(0x0004) (CPF_Edit, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_IsPlainOldData)
	float                                              BlendInSpeed;                                             // 0x0088(0x0004) (CPF_Edit, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_IsPlainOldData)
	float                                              BlendOutSpeed;                                            // 0x008C(0x0004) (CPF_Edit, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_IsPlainOldData)
	struct FHandOnWheelAnimationRanges                 HandOnWheelAnimationRanges;                               // 0x0090(0x0040) (CPF_Edit, CPF_DisableEditOnInstance)
	struct FWheelIKActivationRanges                    WheelArmIKDownWithinRange;                                // 0x00D0(0x0040) (CPF_Edit, CPF_DisableEditOnInstance)
	TEnumAsByte<EWheelAnimationType>                   WheelAnimationType;                                       // 0x0110(0x0001) (CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_IsPlainOldData)
	float                                              WheelTime;                                                // 0x0114(0x0004) (CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_IsPlainOldData)
	float                                              WheelDirection;                                           // 0x0118(0x0004) (CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_IsPlainOldData)
	float                                              RightFingerAlpha;                                         // 0x011C(0x0004) (CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_IsPlainOldData)
	float                                              LeftFingerAlpha;                                          // 0x0120(0x0004) (CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0124(0x0004) MISSED OFFSET
	unsigned char                                      LeftWheelArmDown;                                         // 0x0128(0x0001) (CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_IsPlainOldData)
	unsigned char                                      RightWheelArmDown;                                        // 0x0129(0x0001) (CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_IsPlainOldData)
	unsigned char                                      UnknownData01[0x6];                                       // 0x012A(0x0006) MISSED OFFSET
	class AActor*                                      ControlledObject;                                         // 0x0130(0x0008) (CPF_ZeroConstructor, CPF_IsPlainOldData)
	unsigned char                                      UnknownData02[0x78];                                      // 0x0138(0x0078) MISSED OFFSET
};

// ScriptStruct Athena.AthenaAnimationCapstan
// 0x0138
struct FAthenaAnimationCapstan
{
	float                                              IntentInterpSpeed;                                        // 0x0000(0x0004) (CPF_Edit, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_IsPlainOldData)
	struct FVector2D                                   CapstanAngularVelocityRange;                              // 0x0004(0x0008) (CPF_Edit, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_IsPlainOldData)
	struct FVector2D                                   AnimationRemapSpeedRange;                                 // 0x000C(0x0008) (CPF_Edit, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_IsPlainOldData)
	float                                              AngularVelocityInterpSpeed;                               // 0x0014(0x0004) (CPF_Edit, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_IsPlainOldData)
	struct FSocketId                                   LeftHandMaleSocket;                                       // 0x0018(0x0020) (CPF_Edit, CPF_DisableEditOnInstance)
	struct FSocketId                                   RightHandMaleSocket;                                      // 0x0038(0x0020) (CPF_Edit, CPF_DisableEditOnInstance)
	struct FSocketId                                   LeftHandFemaleSocket;                                     // 0x0058(0x0020) (CPF_Edit, CPF_DisableEditOnInstance)
	struct FSocketId                                   RightHandFemaleSocket;                                    // 0x0078(0x0020) (CPF_Edit, CPF_DisableEditOnInstance)
	float                                              TranslationStrength;                                      // 0x0098(0x0004) (CPF_Edit, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_IsPlainOldData)
	float                                              RotationStrength;                                         // 0x009C(0x0004) (CPF_Edit, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_IsPlainOldData)
	float                                              BlendInSpeed;                                             // 0x00A0(0x0004) (CPF_Edit, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_IsPlainOldData)
	float                                              BlendOutSpeed;                                            // 0x00A4(0x0004) (CPF_Edit, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_IsPlainOldData)
	unsigned char                                      AnimationOverride;                                        // 0x00A8(0x0001) (CPF_Edit, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_IsPlainOldData)
	TEnumAsByte<EAthenaAnimationCapstanState>          CapstanState;                                             // 0x00A9(0x0001) (CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_IsPlainOldData)
	float                                              AngularVelocityWanted;                                    // 0x00AC(0x0004) (CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_IsPlainOldData)
	class AActor*                                      ControlledObject;                                         // 0x00B0(0x0008) (CPF_ZeroConstructor, CPF_IsPlainOldData)
	unsigned char                                      UnknownData00[0x80];                                      // 0x00B8(0x0080) MISSED OFFSET
};

// ScriptStruct Athena.AthenaAnimationControllableFacialAnimData
// 0x0028
struct FAthenaAnimationControllableFacialAnimData
{
	class UBlendSpace1D*                               Capstan;                                                  // 0x0000(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	class UAnimSequence*                               SailAction;                                               // 0x0008(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	class UAnimSequence*                               SailIdle;                                                 // 0x0010(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	class UAnimSequence*                               CannonFire;                                               // 0x0018(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	class UAnimSequence*                               CannonAim;                                                // 0x0020(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
};

// ScriptStruct Athena.AthenaAnimationFacialAnimData
// 0x0080
struct FAthenaAnimationFacialAnimData
{
	int                                                FacialIdleAnimationIndex0;                                // 0x0000(0x0004) (CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	int                                                FacialIdleAnimationIndex1;                                // 0x0004(0x0004) (CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	TArray<class UAnimSequence*>                       IdleAnimations;                                           // 0x0008(0x0010) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor)
	class UAnimSequence*                               Death;                                                    // 0x0018(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	class UAnimSequence*                               HitReact;                                                 // 0x0020(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	struct FAthenaAnimationControllableFacialAnimData  Controllables;                                            // 0x0028(0x0028) (CPF_Edit, CPF_BlueprintVisible)
	class UAnimMontage*                                Sick;                                                     // 0x0050(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	class UAnimSequence*                               Cough;                                                    // 0x0058(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	class UAnimSequence*                               UnderwaterIdle;                                           // 0x0060(0x0008) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	class UAnimMontage*                                CurrentFacialMontage;                                     // 0x0068(0x0008) (CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	class UAnimMontage*                                PlayingFacialMontage;                                     // 0x0070(0x0008) (CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_IsPlainOldData)
	TEnumAsByte<EFacialPriority>                       CurrentFacialPriority;                                    // 0x0078(0x0001) (CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0079(0x0007) MISSED OFFSET
};

// ScriptStruct Athena.AthenaAnimationJumping
// 0x00B0
struct FAthenaAnimationJumping
{
	TEnumAsByte<EAthenaAnimationJumpingState>          JumpingState;                                             // 0x0000(0x0001) (CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_IsPlainOldData)
	float                                              PreImpactTime;                                            // 0x0004(0x0004) (CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_IsPlainOldData)
	int                                                JumpSequence;                                             // 0x0008(0x0004) (CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_IsPlainOldData)
	int                                                LandingSequence;                                          // 0x000C(0x0004) (CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_IsPlainOldData)
	unsigned char                                      FiredFromActor;                                           // 0x0010(0x0001) (CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_IsPlainOldData)
	unsigned char                                      UnknownData00[0x9F];                                      // 0x0011(0x009F) MISSED OFFSET
};

// ScriptStruct Athena.DamageInstance
// 0x0020
struct FDamageInstance
{
	struct FGuid                                       AttackId;                                                 // 0x0000(0x0010) (CPF_ZeroConstructor, CPF_IsPlainOldData)
	class AActor*                                      Instigator;                                               // 0x0010(0x0008) (CPF_ZeroConstructor, CPF_IsPlainOldData)
	float                                              Amount;                                                   // 0x0018(0x0004) (CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
	TEnumAsByte<EHealthChangedReason>                  Reason;                                                   // 0x001C(0x0001) (CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_IsPlainOldData)
};

// ScriptStruct Athena.AthenaAnimationLODSettings
// 0x0003
struct FAthenaAnimationLODSettings
{
	TEnumAsByte<EIKState>                              IKState;                                                  // 0x0000(0x0001) (CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_IsPlainOldData)
	TEnumAsByte<EIKSolverType>                         IKSolverType;                                             // 0x0001(0x0001) (CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_IsPlainOldData)
	TEnumAsByte<EIKFootPlantingState>                  IKFootPlantingState;                                      // 0x0002(0x0001) (CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_IsPlainOldData)
};

// ScriptStruct Athena.AthenaAnimationLocomotion
// 0x0040
struct FAthenaAnimationLocomotion
{
	struct FVector                                     CharacterVelocity;                                        // 0x0000(0x000C) (CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_IsPlainOldData)
	float                                              WantedMovementSpeed;                                      // 0x000C(0x0004) (CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_IsPlainOldData)
	unsigned char                                      CharacterMoving;                                          // 0x0010(0x0001) (CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_IsPlainOldData)
	unsigned char                                      RunStopWanted;                                            // 0x0011(0x0001) (CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_IsPlainOldData)
	float                                              TurnRate;                                                 // 0x0014(0x0004) (CPF_BlueprintVisible, CPF_BlueprintReadOnly, CPF_ZeroConstructor, CPF_IsPlainOldData)
